Ac6Embedded/svd-microchip/SAMA5D2/ATSAMA5D29TA100.svd
         </registers>
      </peripheral>
      <peripheral derivedFrom="FLEXCOM0">
         <name>FLEXCOM1</name>
         <baseAddress>0xF8038000</baseAddress>
         <interrupt>
            <name>FLEXCOM1</name>
            <description>FLEXCOM 1</description>
            <value>20</value>
         </interrupt>
      </peripheral>
      <peripheral derivedFrom="FLEXCOM0">
         <name>FLEXCOM2</name>
         <baseAddress>0xFC010000</baseAddress>
         <interrupt>
            <name>FLEXCOM2</name>
            <description>FLEXCOM 2</description>
            <value>21</value>
         </interrupt>
      </peripheral>
      <peripheral derivedFrom="FLEXCOM0">
         <name>FLEXCOM3</name>
         <baseAddress>0xFC014000</baseAddress>
         <interrupt>
            <name>FLEXCOM3</name>
            <description>FLEXCOM 3</description>
            <value>22</value>
         </interrupt>
      </peripheral>
      <peripheral derivedFrom="FLEXCOM0">
         <name>FLEXCOM4</name>
         <baseAddress>0xFC018000</baseAddress>
         <interrupt>
            <name>FLEXCOM4</name>
            <description>FLEXCOM 4</description>
            <value>23</value>
         </interrupt>
      </peripheral>
      <peripheral>
         <name>GMAC</name>
         <version>441522P03</version>
         <description>Gigabit Ethernet MAC</description>
         <baseAddress>0xF8008000</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x7C0</size>
            <usage>registers</usage>
         </addressBlock>
         <interrupt>
            <name>GMAC</name>
            <description>Ethernet MAC</description>
            <value>5</value>
         </interrupt>
         <interrupt>
            <name>GMAC_Q1</name>
            <description>GMAC Queue 1 Interrupt</description>
            <value>66</value>
         </interrupt>
         <interrupt>
            <name>GMAC_Q2</name>
            <description>GMAC Queue 2 Interrupt</description>
            <value>67</value>
         </interrupt>
         <registers>
            <register>
               <name>NCR</name>
               <description>Network Control Register</description>
               <addressOffset>0x0</addressOffset>
               <fields>
                  <field>
                     <name>LBL</name>
                     <description>Loop Back Local</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>LBLSelect</name>
                        <enumeratedValue>
                           <name>LBL_0</name>
                           <description>Normal operating mode (no loop back).</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LBL_1</name>
                           <description>Connects GTX to GRX, GTXEN to GRXDV and forces Full Duplex mode. GRXCK and GTXCK may malfunction as the GMAC is switched into and out of internal loop back. It is important that receive and transmit circuits have already been disabled when making the switch into and out of internal loop back.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>RXEN</name>
                     <description>Receive Enable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>RXENSelect</name>
                        <enumeratedValue>
                           <name>RXEN_0</name>
                           <description>Stops frame reception immediately and the receive pipeline will be cleared. The Receive Queue Pointer register is unaffected.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RXEN_1</name>
                           <description>Enables the GMAC to receive data.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TXEN</name>
                     <description>Transmit Enable</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>TXENSelect</name>
                        <enumeratedValue>
                           <name>TXEN_0</name>
                           <description>Stops transmission immediately, the transmit pipeline and control registers will be cleared and the Transmit Queue Pointer Register will reset to point to the start of the transmit descriptor list.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TXEN_1</name>
                           <description>Enables the GMAC transmitter to send data.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>MPE</name>
                     <description>Management Port Enable</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>MPESelect</name>
                        <enumeratedValue>
                           <name>MPE_0</name>
                           <description>Forces GMDIO to high impedance state and MDC low.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>MPE_1</name>
                           <description>Enables the management port.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CLRSTAT</name>
                     <description>Clear Statistics Registers (Write-only)</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>CLRSTATSelect</name>
                        <enumeratedValue>
                           <name>CLRSTAT_0</name>
                           <description>No effect.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CLRSTAT_1</name>
                           <description>Clears the statistics registers.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>INCSTAT</name>
                     <description>Increment Statistics Registers (Write-only)</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WESTAT</name>
                     <description>Write Enable for Statistics Registers</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>WESTATSelect</name>
                        <enumeratedValue>
                           <name>WESTAT_0</name>
                           <description>Forces the statistics registers to be in read-only mode for normal operation mode.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>WESTAT_1</name>
                           <description>Makes the statistics registers writable for functional test purposes.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>BP</name>
                     <description>Back Pressure</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>BPSelect</name>
                        <enumeratedValue>
                           <name>BP_0</name>
                           <description>No effect</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>BP_1</name>
                           <description>When the MAC is set in 10M or 100M Half Duplex mode, forces collisions on all received frames.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TSTART</name>
                     <description>Start Transmission (Write-only)</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>TSTARTSelect</name>
                        <enumeratedValue>
                           <name>TSTART_0</name>
                           <description>No effect.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TSTART_1</name>
                           <description>Starts transmission.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>THALT</name>
                     <description>Transmit Halt (Write-only)</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>THALTSelect</name>
                        <enumeratedValue>
                           <name>THALT_0</name>
                           <description>No effect.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>THALT_1</name>
                           <description>Halts transmission as soon as any ongoing frame transmission ends.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TXPF</name>
                     <description>Transmit Pause Frame (Write-only)</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>TXPFSelect</name>
                        <enumeratedValue>
                           <name>TXPF_0</name>
                           <description>No effect.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TXPF_1</name>
                           <description>Generates a pause frame to be transmitted.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TXZQPF</name>
                     <description>Transmit Zero Quantum Pause Frame (Write-only)</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>TXZQPFSelect</name>
                        <enumeratedValue>
                           <name>TXZQPF_0</name>
                           <description>No effect.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TXZQPF_1</name>
                           <description>Generates a pause frame with zero quantum to be transmitted.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SRTSM</name>
                     <description>Store Receive Timestamp to Memory</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>SRTSMSelect</name>
                        <enumeratedValue>
                           <name>SRTSM_0</name>
                           <description>No effect.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SRTSM_1</name>
                           <description>Causes the CRC of every received frame to be replaced with the value of the nanoseconds field of the 1588 timer that was captured as the receive frame passed the message timestamp point. Note that bit RFCS in register GMAC_NCFGR may not be set to 1 when the timer should be captured.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ENPBPR</name>
                     <description>Enable PFC Priority-based Pause Reception</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXPBPF</name>
                     <description>Transmit PFC Priority-based Pause Frame</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>TXPBPFSelect</name>
                        <enumeratedValue>
                           <name>TXPBPF_0</name>
                           <description>No effect.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TXPBPF_1</name>
                           <description>Takes the values stored in the Transmit PFC Pause Register.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>FNP</name>
                     <description>Flush Next Packet</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>FNPSelect</name>
                        <enumeratedValue>
                           <name>FNP_0</name>
                           <description>No effect.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FNP_1</name>
                           <description>Flushes the next packet from the receive memory. This will only have an effect if the DMA is not currently writing a packet already stored in the receive memory to system memory.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TXLPIEN</name>
                     <description>Enable LPI Transmission</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PTPUNIENA</name>
                     <description>Detection of Unicast PTP Frames Enable</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>PTPUNIENASelect</name>
                        <enumeratedValue>
                           <name>PTPUNIENA_0</name>
                           <description>Disables detection of unicast PTP frames.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PTPUNIENA_1</name>
                           <description>Enables detection of unicast PTP frames.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>STUDPOFFSET</name>
                     <description>Store UDP Offset</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>STUDPOFFSETSelect</name>
                        <enumeratedValue>
                           <name>STUDPOFFSET_0</name>
                           <description>Normal operations.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>STUDPOFFSET_1</name>
                           <description>The upper 16 bits of the CRC of every received frame are replaced with the offset from start of frame to the beginning of the UDP or TCP header. The lower 16 bits of the CRC are replaced with zero and reserved for future use. The offset is measured in units of 2 bytes.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>OSSMODE</name>
                     <description>One Step Sync Mode</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>OSSMODESelect</name>
                        <enumeratedValue>
                           <name>OSSMODE_0</name>
                           <description>1588 One Step Sync Mode is disabled.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>OSSMODE_1</name>
                           <description>1588 One Step Sync Mode is enabled. Replaces timestamp field in the 1588 header for TX Sync Frames with the current TSU timer value.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>PFCCTL</name>
                     <description>Multiple PFC Pause quantum Enable</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>PFCCTLSelect</name>
                        <enumeratedValue>
                           <name>PFCCTL_0</name>
                           <description>Disables multiple PFC pause quantums.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PFCCTL_1</name>
                           <description>Enables multiple PFC pause quantums, one per pause priority.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>EXTSELRQEN</name>
                     <description>External Selection of Receive Queue Enable</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                     <writeConstraint>
