Ac6Embedded/svd-microchip/SAMA5D2/ATSAMA5D29TA100.svd
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>EXTSELRQENSelect</name>
                        <enumeratedValue>
                           <name>EXTSELRQEN_0</name>
                           <description>Disables external selection of receive queue.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EXTSELRQEN_1</name>
                           <description>Enables external selection of receive queue.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>OSSCORR</name>
                     <description>OSS Correction Field</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MIIONRGMII</name>
                     <description>MII Control</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>MIIONRGMIISelect</name>
                        <enumeratedValue>
                           <name>MIIONRGMII_0</name>
                           <description>Disables MII operation.</description>
                           <value>0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>IFGQAVCRED</name>
                     <description>Credit-Based Shaping Algorithm Modification</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>IFGQAVCREDSelect</name>
                        <enumeratedValue>
                           <name>IFGQAVCRED_0</name>
                           <description>No modification of the CBS algorithm.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>IFGQAVCRED_1</name>
                           <description>Modifies the CBS algorithm so the IFG/IPG associated with a transmit frame counts towards its 802.1Qav credit.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>NCFGR</name>
               <description>Network Configuration Register</description>
               <addressOffset>0x4</addressOffset>
               <resetValue>0x00080000</resetValue>
               <fields>
                  <field>
                     <name>SPD</name>
                     <description>Speed</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FD</name>
                     <description>Full Duplex</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DNVLAN</name>
                     <description>Discard Non-VLAN FRAMES</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>JFRAME</name>
                     <description>Jumbo Frame Size</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CAF</name>
                     <description>Copy All Frames</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NBC</name>
                     <description>No Broadcast</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MTIHEN</name>
                     <description>Multicast Hash Enable</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>UNIHEN</name>
                     <description>Unicast Hash Enable</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MAXFS</name>
                     <description>1536 Maximum Frame Size</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RTY</name>
                     <description>Retry Test0</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PEN</name>
                     <description>Pause Enable</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXBUFO</name>
                     <description>Receive Buffer Offset</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>LFERD</name>
                     <description>Length Field Error Frame Discard</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RFCS</name>
                     <description>Remove FCS</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CLK</name>
                     <description>MDC CLock Division</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>3</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>CLKSelect</name>
                        <enumeratedValue>
                           <name>MCK_8</name>
                           <description>MCK divided by 8 (MCK up to 20 MHz)</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>MCK_16</name>
                           <description>MCK divided by 16 (MCK up to 40 MHz)</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>MCK_32</name>
                           <description>MCK divided by 32 (MCK up to 80 MHz)</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>MCK_48</name>
                           <description>MCK divided by 48 (MCK up to 120 MHz)</description>
                           <value>3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>MCK_64</name>
                           <description>MCK divided by 64 (MCK up to 160 MHz)</description>
                           <value>4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>MCK_96</name>
                           <description>MCK divided by 96 (MCK up to 240 MHz)</description>
                           <value>5</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DBW</name>
                     <description>Data Bus Width</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>DCPF</name>
                     <description>Disable Copy of Pause Frames</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXCOEN</name>
                     <description>Receive Checksum Offload Enable</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EFRHD</name>
                     <description>Enable Frames Received in Half Duplex</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IRXFCS</name>
                     <description>Ignore RX FCS</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IPGSEN</name>
                     <description>IP Stretch Enable</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXBP</name>
                     <description>Receive Bad Preamble</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IRXER</name>
                     <description>Ignore Receive Error from PHY</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>NSR</name>
               <description>Network Status Register</description>
               <addressOffset>0x8</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>MDIO</name>
                     <description>MDIO Input Status</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IDLE</name>
                     <description>PHY Management Logic Idle</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PFCPAUSN</name>
                     <description>PFC Pause Negotiated</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXLPIS</name>
                     <description>LPI Indication</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>UR</name>
               <description>User Register</description>
               <addressOffset>0xC</addressOffset>
               <fields>
                  <field>
                     <name>RMII</name>
                     <description>Reduced MII Mode</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>RMIISelect</name>
                        <enumeratedValue>
                           <name>RMII_1</name>
                           <description>RMII mode is selected.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>HDFLCTLEN</name>
                     <description>Half Duplex Flow Control Enable</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>HDFLCTLENSelect</name>
                        <enumeratedValue>
                           <name>HDFLCTLEN_0</name>
                           <description>Half duplex flow control is disabled.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>HDFLCTLEN_1</name>
                           <description>Half duplex flow control is enabled.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
