Ac6Embedded/svd-microchip/SAMA5D2/ATSAMA5D29TA100.svd
            <register>
               <name>ISR</name>
               <description>Interrupt Status Register</description>
               <addressOffset>0x24</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>MFS</name>
                     <description>Management Frame Sent (Cleared on read)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RCOMP</name>
                     <description>Receive Complete (Cleared on read)</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXUBR</name>
                     <description>RX Used Bit Read (Cleared on read)</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXUBR</name>
                     <description>TX Used Bit Read (Cleared on read)</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TUR</name>
                     <description>Transmit Underrun (Cleared on read)</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RLEX</name>
                     <description>Retry Limit Exceeded(Cleared on read)</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TFC</name>
                     <description>Transmit Frame Corruption Due to System Bus Error (Cleared on read)</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TCOMP</name>
                     <description>Transmit Complete (Cleared on read)</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ROVR</name>
                     <description>Receive Overrun (Cleared on read)</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>HRESP</name>
                     <description>System Bus Error (Cleared on read)</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PFNZ</name>
                     <description>Pause Frame with Non-zero Pause Quantum Received (Cleared on read)</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PTZ</name>
                     <description>Pause Time Zero (Cleared on read)</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PFTR</name>
                     <description>Pause Frame Transmitted (Cleared on read)</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DRQFR</name>
                     <description>PTP Delay Request Frame Received (Cleared on read)</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SFR</name>
                     <description>PTP Sync Frame Received (Cleared on read)</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DRQFT</name>
                     <description>PTP Delay Request Frame Transmitted (Cleared on read)</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SFT</name>
                     <description>PTP Sync Frame Transmitted (Cleared on read)</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PDRQFR</name>
                     <description>PDelay Request Frame Received (Cleared on read)</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PDRSFR</name>
                     <description>PDelay Response Frame Received (Cleared on read)</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PDRQFT</name>
                     <description>PDelay Request Frame Transmitted (Cleared on read)</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PDRSFT</name>
                     <description>PDelay Response Frame Transmitted (Cleared on read)</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SRI</name>
                     <description>TSU Seconds Register Increment (Cleared on read)</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXLPISBC</name>
                     <description>Receive LPI indication Status Bit Change (Cleared on read)</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WOL</name>
                     <description>Wake On LAN</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TSUTIMCOMP</name>
                     <description>TSU Timer Comparison (Cleared on read)</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>IER</name>
               <description>Interrupt Enable Register</description>
               <addressOffset>0x28</addressOffset>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>MFS</name>
                     <description>Management Frame Sent</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RCOMP</name>
                     <description>Receive Complete</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXUBR</name>
                     <description>RX Used Bit Read</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXUBR</name>
                     <description>TX Used Bit Read</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TUR</name>
                     <description>Transmit Underrun</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RLEX</name>
                     <description>Retry Limit Exceeded or Late Collision</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TFC</name>
                     <description>Transmit Frame Corruption Due to System Bus Error</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TCOMP</name>
                     <description>Transmit Complete</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ROVR</name>
                     <description>Receive Overrun</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>HRESP</name>
                     <description>System Bus Error</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PFNZ</name>
                     <description>Pause Frame with Non-zero Pause Quantum Received</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PTZ</name>
                     <description>Pause Time Zero</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PFTR</name>
                     <description>Pause Frame Transmitted</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EXINT</name>
                     <description>External Interrupt</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DRQFR</name>
                     <description>PTP Delay Request Frame Received</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SFR</name>
                     <description>PTP Sync Frame Received</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DRQFT</name>
                     <description>PTP Delay Request Frame Transmitted</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SFT</name>
                     <description>PTP Sync Frame Transmitted</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PDRQFR</name>
                     <description>PDelay Request Frame Received</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PDRSFR</name>
                     <description>PDelay Response Frame Received</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PDRQFT</name>
                     <description>PDelay Request Frame Transmitted</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PDRSFT</name>
                     <description>PDelay Response Frame Transmitted</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SRI</name>
                     <description>TSU Seconds Register Increment</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXLPISBC</name>
                     <description>Enable RX LPI Indication</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WOL</name>
                     <description>Wake On LAN</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TSUTIMCOMP</name>
                     <description>TSU Timer Comparison</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>IDR</name>
               <description>Interrupt Disable Register</description>
               <addressOffset>0x2C</addressOffset>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>MFS</name>
                     <description>Management Frame Sent</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RCOMP</name>
                     <description>Receive Complete</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXUBR</name>
                     <description>RX Used Bit Read</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXUBR</name>
                     <description>TX Used Bit Read</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TUR</name>
                     <description>Transmit Underrun</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RLEX</name>
                     <description>Retry Limit Exceeded or Late Collision</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TFC</name>
                     <description>Transmit Frame Corruption Due to System Bus Error</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TCOMP</name>
                     <description>Transmit Complete</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ROVR</name>
                     <description>Receive Overrun</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>HRESP</name>
                     <description>System Bus Error</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PFNZ</name>
                     <description>Pause Frame with Non-zero Pause Quantum Received</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PTZ</name>
                     <description>Pause Time Zero</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PFTR</name>
                     <description>Pause Frame Transmitted</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EXINT</name>
                     <description>External Interrupt</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DRQFR</name>
                     <description>PTP Delay Request Frame Received</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SFR</name>
                     <description>PTP Sync Frame Received</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DRQFT</name>
                     <description>PTP Delay Request Frame Transmitted</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SFT</name>
                     <description>PTP Sync Frame Transmitted</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PDRQFR</name>
                     <description>PDelay Request Frame Received</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PDRSFR</name>
                     <description>PDelay Response Frame Received</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PDRQFT</name>
                     <description>PDelay Request Frame Transmitted</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PDRSFT</name>
                     <description>PDelay Response Frame Transmitted</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SRI</name>
                     <description>TSU Seconds Register Increment</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXLPISBC</name>
                     <description>Enable RX LPI Indication</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WOL</name>
                     <description>Wake On LAN</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TSUTIMCOMP</name>
                     <description>TSU Timer Comparison</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
