Ac6Embedded/svd-microchip/SAMA5D2/ATSAMA5D29TA100.svd
            <register>
               <name>IMR</name>
               <description>Interrupt Mask Register</description>
               <addressOffset>0x30</addressOffset>
               <resetValue>0x07FFFFFF</resetValue>
               <fields>
                  <field>
                     <name>MFS</name>
                     <description>Management Frame Sent</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RCOMP</name>
                     <description>Receive Complete</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXUBR</name>
                     <description>RX Used Bit Read</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXUBR</name>
                     <description>TX Used Bit Read</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TUR</name>
                     <description>Transmit Underrun</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RLEX</name>
                     <description>Retry Limit Exceeded</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TFC</name>
                     <description>Transmit Frame Corruption Due to System Bus Error</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TCOMP</name>
                     <description>Transmit Complete</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ROVR</name>
                     <description>Receive Overrun</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>HRESP</name>
                     <description>System Bus Error</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PFNZ</name>
                     <description>Pause Frame with Non-zero Pause Quantum Received</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PTZ</name>
                     <description>Pause Time Zero</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PFTR</name>
                     <description>Pause Frame Transmitted</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EXINT</name>
                     <description>External Interrupt</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DRQFR</name>
                     <description>PTP Delay Request Frame Received</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SFR</name>
                     <description>PTP Sync Frame Received</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DRQFT</name>
                     <description>PTP Delay Request Frame Transmitted</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SFT</name>
                     <description>PTP Sync Frame Transmitted</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PDRQFR</name>
                     <description>PDelay Request Frame Received</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PDRSFR</name>
                     <description>PDelay Response Frame Received</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PDRQFT</name>
                     <description>PDelay Request Frame Transmitted</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PDRSFT</name>
                     <description>PDelay Response Frame Transmitted</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SRI</name>
                     <description>TSU Seconds Register Increment</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXLPISBC</name>
                     <description>Enable RX LPI Indication</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WOL</name>
                     <description>Wake On LAN</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TSUTIMCOMP</name>
                     <description>TSU Timer Comparison</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MAN</name>
               <description>PHY Maintenance Register</description>
               <addressOffset>0x34</addressOffset>
               <fields>
                  <field>
                     <name>DATA</name>
                     <description>PHY Data</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>WTN</name>
                     <description>Write Ten</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>REGA</name>
                     <description>Register Address</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>PHYA</name>
                     <description>PHY Address</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>OP</name>
                     <description>Operation</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>2</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>OPSelect</name>
                        <enumeratedValue>
                           <name>OP_1</name>
                           <description>Write</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>OP_2</name>
                           <description>Read</description>
                           <value>2</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CLTTO</name>
                     <description>Clause 22 Operation</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>CLTTOSelect</name>
                        <enumeratedValue>
                           <name>CLTTO_0</name>
                           <description>Clause 45 operation</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CLTTO_1</name>
                           <description>Clause 22 operation</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>WZO</name>
                     <description>Write ZERO</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>RPQ</name>
               <description>Receive Pause Quantum Register</description>
               <addressOffset>0x38</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>RPQ</name>
                     <description>Received Pause Quantum</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>TPQ</name>
               <description>Transmit Pause Quantum Register</description>
               <addressOffset>0x3C</addressOffset>
               <resetValue>0xFFFFFFFF</resetValue>
               <fields>
                  <field>
                     <name>TPQ</name>
                     <description>Transmit Pause Quantum</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>P1TPQ</name>
                     <description>Priority 1 Transmit Pause Quantum</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>RJFML</name>
               <description>RX Jumbo Frame Max Length Register</description>
               <addressOffset>0x48</addressOffset>
               <resetValue>0x00003FFF</resetValue>
               <fields>
                  <field>
                     <name>FML</name>
                     <description>Frame Max Length</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>14</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>INTM</name>
               <description>Interrupt Moderation Register</description>
               <addressOffset>0x5C</addressOffset>
               <fields>
                  <field>
                     <name>RXINTMOD</name>
                     <description>Receive Interrupt Moderation</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>TXINTMOD</name>
                     <description>Transmit Interrupt Moderation</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SYSWT</name>
               <description>System Wake-Up Time Register</description>
               <addressOffset>0x60</addressOffset>
               <fields>
                  <field>
                     <name>SYSWKUPTIME</name>
                     <description>System Wake-up Time</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HRB</name>
               <description>Hash Register Bottom</description>
               <addressOffset>0x80</addressOffset>
               <fields>
                  <field>
                     <name>ADDR</name>
                     <description>Hash Address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HRT</name>
               <description>Hash Register Top</description>
               <addressOffset>0x84</addressOffset>
               <fields>
                  <field>
                     <name>ADDR</name>
                     <description>Hash Address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <cluster>
               <dim>4</dim>
               <dimIncrement>8</dimIncrement>
               <dimIndex>1-4</dimIndex>
               <name>GMAC_SA%s</name>
               <description>Specific Address Register</description>
               <addressOffset>0x088</addressOffset>
               <register>
                  <name>SAB</name>
                  <description>Specific Address 1 Bottom Register</description>
                  <addressOffset>0x00</addressOffset>
                  <fields>
                     <field>
                        <name>ADDR</name>
                        <description>Specific Address 1</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>32</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>SAT</name>
                  <description>Specific Address 1 Top Register</description>
                  <addressOffset>0x04</addressOffset>
                  <fields>
                     <field>
                        <name>ADDR</name>
                        <description>Specific Address 2</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>16</bitWidth>
                     </field>
                     <field>
                        <name>FILTSORD</name>
                        <description>Filter Source or Destination MAC Address</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>1</bitWidth>
                        <writeConstraint>
                           <useEnumeratedValues>true</useEnumeratedValues>
                        </writeConstraint>
                        <enumeratedValues>
                           <name>FILTSORDSelect</name>
                           <enumeratedValue>
                              <name>FILTSORD_0</name>
                              <description>The filter is a destination address filter.</description>
                              <value>0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>FILTSORD_1</name>
                              <description>The filter is a source address filter.</description>
                              <value>1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>FILTBMASK</name>
                        <description>Filter Bytes Mask</description>
                        <bitOffset>24</bitOffset>
                        <bitWidth>6</bitWidth>
                        <writeConstraint>
                           <useEnumeratedValues>true</useEnumeratedValues>
                        </writeConstraint>
                        <enumeratedValues>
                           <name>FILTBMASKSelect</name>
                           <enumeratedValue>
                              <name>BIT1</name>
                              <description>Controls whether the first byte has been received.</description>
                              <value>0x1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>BIT2</name>
                              <description>Controls whether the second byte has been received.</description>
                              <value>0x2</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>BIT3</name>
                              <description>Controls whether the third byte has been received.</description>
                              <value>0x4</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>BIT4</name>
                              <description>Controls whether the fourth byte has been received.</description>
                              <value>0x8</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>BIT5</name>
                              <description>Controls whether the fifth byte has been received.</description>
                              <value>0x10</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>BIT6</name>
                              <description>Controls whether the sixth byte has been received</description>
                              <value>0x20</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                  </fields>
               </register>
            </cluster>
            <register>
               <name>TIDM1</name>
               <description>Type ID Match 1 Register</description>
               <addressOffset>0xA8</addressOffset>
               <fields>
                  <field>
                     <name>TID</name>
                     <description>Type ID Match 1</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>ENID1</name>
                     <description>Enable Copying of TID Matched Frames</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>ENID1Select</name>
                        <enumeratedValue>
                           <name>ENID1_0</name>
                           <description>TID is not part of the comparison match.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENID1_1</name>
                           <description>TID is processed for the comparison match.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>TIDM2</name>
               <description>Type ID Match 2 Register</description>
               <addressOffset>0xAC</addressOffset>
               <fields>
                  <field>
                     <name>TID</name>
                     <description>Type ID Match 2</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>ENID2</name>
                     <description>Enable Copying of TID Matched Frames</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>ENID2Select</name>
                        <enumeratedValue>
                           <name>ENID2_0</name>
                           <description>TID is not part of the comparison match.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENID2_1</name>
                           <description>TID is processed for the comparison match.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
