Ac6Embedded/svd-microchip/SAMA5D2/ATSAMA5D29TA100.svd
            <register>
               <name>TIDM3</name>
               <description>Type ID Match 3 Register</description>
               <addressOffset>0xB0</addressOffset>
               <fields>
                  <field>
                     <name>TID</name>
                     <description>Type ID Match 3</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>ENID3</name>
                     <description>Enable Copying of TID Matched Frames</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>ENID3Select</name>
                        <enumeratedValue>
                           <name>ENID3_0</name>
                           <description>TID is not part of the comparison match.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENID3_1</name>
                           <description>TID is processed for the comparison match.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>TIDM4</name>
               <description>Type ID Match 4 Register</description>
               <addressOffset>0xB4</addressOffset>
               <fields>
                  <field>
                     <name>TID</name>
                     <description>Type ID Match 4</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>ENID4</name>
                     <description>Enable Copying of TID Matched Frames</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>ENID4Select</name>
                        <enumeratedValue>
                           <name>ENID4_0</name>
                           <description>TID is not part of the comparison match.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENID4_1</name>
                           <description>TID is processed for the comparison match.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>WOL</name>
               <description>Wake on LAN Register</description>
               <addressOffset>0xB8</addressOffset>
               <fields>
                  <field>
                     <name>IP</name>
                     <description>ARP Request IP Address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>MAG</name>
                     <description>Magic Packet Event Enable</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ARP</name>
                     <description>ARP Request Event Enable</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SA1</name>
                     <description>Specific Address Register 1 Event Enable</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MTI</name>
                     <description>Multicast Hash Event Enable</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>IPGS</name>
               <description>IPG Stretch Register</description>
               <addressOffset>0xBC</addressOffset>
               <fields>
                  <field>
                     <name>FL</name>
                     <description>Frame Length</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SVLAN</name>
               <description>Stacked VLAN Register</description>
               <addressOffset>0xC0</addressOffset>
               <fields>
                  <field>
                     <name>VLAN_TYPE</name>
                     <description>User Defined VLAN_TYPE Field</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>ESVLAN</name>
                     <description>Enable Stacked VLAN Processing Mode</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>ESVLANSelect</name>
                        <enumeratedValue>
                           <name>ESVLAN_0</name>
                           <description>Disable the stacked VLAN Processing mode</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ESVLAN_1</name>
                           <description>Enable the stacked VLAN Processing mode</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>TPFCP</name>
               <description>Transmit PFC Pause Register</description>
               <addressOffset>0xC4</addressOffset>
               <fields>
                  <field>
                     <name>PEV</name>
                     <description>Priority Enable Vector</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>PQ</name>
                     <description>Pause Quantum</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SAMB1</name>
               <description>Specific Address 1 Mask Bottom Register</description>
               <addressOffset>0xC8</addressOffset>
               <fields>
                  <field>
                     <name>ADDR</name>
                     <description>Specific Address 1 Mask</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SAMT1</name>
               <description>Specific Address 1 Mask Top Register</description>
               <addressOffset>0xCC</addressOffset>
               <fields>
                  <field>
                     <name>ADDR</name>
                     <description>Specific Address 1 Mask</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>AMRX</name>
               <description>System Memory Address Mask for RX Data Buffer Accesses Register</description>
               <addressOffset>0xD0</addressOffset>
               <fields>
                  <field>
                     <name>MSBADDRMSK</name>
                     <description>Mask of the Receive Data Buffer Address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>MSBADDR</name>
                     <description>MSB of the Receive Data Buffer Address</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>RXUDAR</name>
               <description>PTP RX Unicast IP Destination Address Register</description>
               <addressOffset>0xD4</addressOffset>
               <fields>
                  <field>
                     <name>RXUDA</name>
                     <description>Receive Unicast Destination Address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>TXUDAR</name>
               <description>PTP TX Unicast IP Destination Address Register</description>
               <addressOffset>0xD8</addressOffset>
               <fields>
                  <field>
                     <name>TXUDA</name>
                     <description>Transmit Unicast Destination Address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>NSC</name>
               <description>1588 Timer Nanosecond Comparison Register</description>
               <addressOffset>0xDC</addressOffset>
               <fields>
                  <field>
                     <name>NANOSEC</name>
                     <description>1588 Timer Nanosecond Comparison Value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>22</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SCL</name>
               <description>1588 Timer Second Comparison Low Register</description>
               <addressOffset>0xE0</addressOffset>
               <fields>
                  <field>
                     <name>SEC</name>
                     <description>1588 Timer Second Comparison Value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SCH</name>
               <description>1588 Timer Second Comparison High Register</description>
               <addressOffset>0xE4</addressOffset>
               <fields>
                  <field>
                     <name>SEC</name>
                     <description>1588 Timer Second Comparison Value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>EFTSH</name>
               <description>PTP Event Frame Transmitted Seconds High Register</description>
               <addressOffset>0xE8</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>RUD</name>
                     <description>Register Update</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>EFRSH</name>
               <description>PTP Event Frame Received Seconds High Register</description>
               <addressOffset>0xEC</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>RUD</name>
                     <description>Register Update</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PEFTSH</name>
               <description>PTP Peer Event Frame Transmitted Seconds High Register</description>
               <addressOffset>0xF0</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>RUD</name>
                     <description>Register Update</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PEFRSH</name>
               <description>PTP Peer Event Frame Received Seconds High Register</description>
               <addressOffset>0xF4</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>RUD</name>
                     <description>Register Update</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OTLO</name>
               <description>Octets Transmitted Low Register</description>
               <addressOffset>0x100</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>TXO</name>
                     <description>Transmitted Octets</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OTHI</name>
               <description>Octets Transmitted High Register</description>
               <addressOffset>0x104</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>TXO</name>
                     <description>Transmitted Octets</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>FT</name>
               <description>Frames Transmitted Register</description>
               <addressOffset>0x108</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>FTX</name>
                     <description>Frames Transmitted without Error</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>BCFT</name>
               <description>Broadcast Frames Transmitted Register</description>
               <addressOffset>0x10C</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>BFTX</name>
                     <description>Broadcast Frames Transmitted without Error</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MFT</name>
               <description>Multicast Frames Transmitted Register</description>
               <addressOffset>0x110</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>MFTX</name>
                     <description>Multicast Frames Transmitted without Error</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PFT</name>
               <description>Pause Frames Transmitted Register</description>
               <addressOffset>0x114</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>PFTX</name>
                     <description>Pause Frames Transmitted Register</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>BFT64</name>
               <description>64 Byte Frames Transmitted Register</description>
               <addressOffset>0x118</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>NFTX</name>
                     <description>64 Byte Frames Transmitted without Error</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>TBFT127</name>
               <description>65 to 127 Byte Frames Transmitted Register</description>
               <addressOffset>0x11C</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>NFTX</name>
                     <description>65 to 127 Byte Frames Transmitted without Error</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>TBFT255</name>
               <description>128 to 255 Byte Frames Transmitted Register</description>
               <addressOffset>0x120</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>NFTX</name>
                     <description>128 to 255 Byte Frames Transmitted without Error</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>TBFT511</name>
               <description>256 to 511 Byte Frames Transmitted Register</description>
               <addressOffset>0x124</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>NFTX</name>
                     <description>256 to 511 Byte Frames Transmitted without Error</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>TBFT1023</name>
               <description>512 to 1023 Byte Frames Transmitted Register</description>
               <addressOffset>0x128</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>NFTX</name>
                     <description>512 to 1023 Byte Frames Transmitted without Error</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>TBFT1518</name>
               <description>1024 to 1518 Byte Frames Transmitted Register</description>
               <addressOffset>0x12C</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>NFTX</name>
                     <description>1024 to 1518 Byte Frames Transmitted without Error</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>GTBFT1518</name>
               <description>Greater Than 1518 Byte Frames Transmitted Register</description>
               <addressOffset>0x130</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>NFTX</name>
                     <description>Greater than 1518 Byte Frames Transmitted without Error</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>TUR</name>
               <description>Transmit Underruns Register</description>
               <addressOffset>0x134</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>TXUNR</name>
                     <description>Transmit Underruns</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>10</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SCF</name>
               <description>Single Collision Frames Register</description>
               <addressOffset>0x138</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>SCOL</name>
                     <description>Single Collision</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>18</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MCF</name>
               <description>Multiple Collision Frames Register</description>
               <addressOffset>0x13C</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>MCOL</name>
                     <description>Multiple Collision</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>18</bitWidth>
                  </field>
               </fields>
            </register>
