Ac6Embedded/svd-microchip/SAMA5D2/ATSAMA5D29TA100.svd
            <register>
               <name>PEFTN</name>
               <description>PTP Peer Event Frame Transmitted Nanoseconds Register</description>
               <addressOffset>0x1F4</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>RUD</name>
                     <description>Register Update</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>30</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PEFRSL</name>
               <description>PTP Peer Event Frame Received Seconds Low Register</description>
               <addressOffset>0x1F8</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>RUD</name>
                     <description>Register Update</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PEFRN</name>
               <description>PTP Peer Event Frame Received Nanoseconds Register</description>
               <addressOffset>0x1FC</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>RUD</name>
                     <description>Register Update</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>30</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>RXLPI</name>
               <description>Received LPI Transitions</description>
               <addressOffset>0x270</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>COUNT</name>
                     <description>Count of Received LPI transitions (cleared on read)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>RXLPITIME</name>
               <description>Received LPI Time</description>
               <addressOffset>0x274</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>LPITIME</name>
                     <description>Time in LPI (cleared on read)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>24</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>TXLPI</name>
               <description>Transmit LPI Transitions</description>
               <addressOffset>0x278</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>COUNT</name>
                     <description>Count of LPI transitions (cleared on read)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>TXLPITIME</name>
               <description>Transmit LPI Time</description>
               <addressOffset>0x27C</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>LPITIME</name>
                     <description>Time in LPI (cleared on read)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>24</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>2</dim>
               <dimIncrement>4</dimIncrement>
               <name>ISRPQ[%s]</name>
               <description>Interrupt Status Register Priority Queue (index = 1)</description>
               <addressOffset>0x400</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>RCOMP</name>
                     <description>Receive Complete</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXUBR</name>
                     <description>RX Used Bit Read</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RLEX</name>
                     <description>Retry Limit Exceeded or Late Collision</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TFC</name>
                     <description>Transmit Frame Corruption Due to System Bus Error</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TCOMP</name>
                     <description>Transmit Complete</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>HRESP</name>
                     <description>System Bus Error</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>2</dim>
               <dimIncrement>4</dimIncrement>
               <name>TBQBAPQ[%s]</name>
               <description>Transmit Buffer Queue Base Address Register Priority Queue (index = 1)</description>
               <addressOffset>0x440</addressOffset>
               <fields>
                  <field>
                     <name>TXBQBA</name>
                     <description>Transmit Buffer Queue Base Address</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>30</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>2</dim>
               <dimIncrement>4</dimIncrement>
               <name>RBQBAPQ[%s]</name>
               <description>Receive Buffer Queue Base Address Register Priority Queue (index = 1)</description>
               <addressOffset>0x480</addressOffset>
               <fields>
                  <field>
                     <name>RXBQBA</name>
                     <description>Receive Buffer Queue Base Address</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>30</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>2</dim>
               <dimIncrement>4</dimIncrement>
               <name>RBSRPQ[%s]</name>
               <description>Receive Buffer Size Register Priority Queue (index = 1)</description>
               <addressOffset>0x4A0</addressOffset>
               <resetValue>0x00000002</resetValue>
               <fields>
                  <field>
                     <name>RBS</name>
                     <description>Receive Buffer Size</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>RBSSelect</name>
                        <enumeratedValue>
                           <name>0x02</name>
                           <description>128 bytes</description>
                           <value>0x02</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0x18</name>
                           <description>1536 bytes (1 x max length frame/buffer)</description>
                           <value>0x18</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0xA0</name>
                           <description>10240 bytes (1 x 10K jumbo frame/buffer)</description>
                           <value>0xA0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>CBSCR</name>
               <description>Credit-Based Shaping Control Register</description>
               <addressOffset>0x4BC</addressOffset>
               <fields>
                  <field>
                     <name>QAE</name>
                     <description>Queue A CBS Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>QAESelect</name>
                        <enumeratedValue>
                           <name>QAE_0</name>
                           <description>Credit-based shaping on the second highest priority queue (queue A) is disabled.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>QAE_1</name>
                           <description>Credit-based shaping on the second highest priority queue (queue A) is enabled.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>QBE</name>
                     <description>Queue B CBS Enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>QBESelect</name>
                        <enumeratedValue>
                           <name>QBE_0</name>
                           <description>Credit-based shaping on the highest priority queue (queue B) is disabled.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>QBE_1</name>
                           <description>Credit-based shaping on the highest priority queue (queue B) is enabled.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>CBSISQA</name>
               <description>Credit-Based Shaping IdleSlope Register for Queue A</description>
               <addressOffset>0x4C0</addressOffset>
               <fields>
                  <field>
                     <name>IS</name>
                     <description>IdleSlope</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CBSISQB</name>
               <description>Credit-Based Shaping IdleSlope Register for Queue B</description>
               <addressOffset>0x4C4</addressOffset>
               <fields>
                  <field>
                     <name>IS</name>
                     <description>IdleSlope</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>TQUBA</name>
               <description>32 MSB Transmit Buffer Descriptor Queue Base Address Register</description>
               <addressOffset>0x4C8</addressOffset>
               <fields>
                  <field>
                     <name>TQUBA</name>
                     <description>Transmit Queue Upper Buffer Address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>TXBDCTRL</name>
               <description>Transmit Buffer Data Control Register</description>
               <addressOffset>0x4CC</addressOffset>
               <fields>
                  <field>
                     <name>TSMODE</name>
                     <description>Transmit Descriptor Timestamp Insertion Mode</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>2</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>TSMODESelect</name>
                        <enumeratedValue>
                           <name>DISABLE</name>
                           <description>Timestamp insertion disable.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PTPEVENT</name>
                           <description>Timestamp inserted for PTP Event Frames only.</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PTPALL</name>
                           <description>Timestamp inserted for All PTP Frames only.</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ALL</name>
                           <description>Timestamp inserted for All Frames.</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>RXBDCTRL</name>
               <description>Receive Buffer Data Control Register</description>
               <addressOffset>0x4D0</addressOffset>
               <fields>
                  <field>
                     <name>TSMODE</name>
                     <description>Receive Descriptor Timestamp Insertion Mode</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>2</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>TSMODESelect</name>
                        <enumeratedValue>
                           <name>DISABLE</name>
                           <description>Timestamp insertion disable.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PTPEVENT</name>
                           <description>Timestamp inserted for PTP Event Frames only.</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PTPALL</name>
                           <description>Timestamp inserted for All PTP Frames only.</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ALL</name>
                           <description>Timestamp inserted for All Frames.</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>RQUBA</name>
               <description>32 MSB Receive Buffer Descriptor Queue Base Address Register</description>
               <addressOffset>0x4D4</addressOffset>
               <fields>
                  <field>
                     <name>RQUBA</name>
                     <description>Receive Queue Upper Buffer Address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>4</dim>
               <dimIncrement>4</dimIncrement>
               <name>ST1RPQ[%s]</name>
               <description>Screening Type 1 Register Priority Queue (index = 0)</description>
               <addressOffset>0x500</addressOffset>
               <fields>
                  <field>
                     <name>QNB</name>
                     <description>Queue Number (0-2)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>DSTCM</name>
                     <description>Differentiated Services or Traffic Class Match</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>UDPM</name>
                     <description>UDP Port Match</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>DSTCE</name>
                     <description>Differentiated Services or Traffic Class Match Enable</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>UDPE</name>
                     <description>UDP Port Match Enable</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
