Ac6Embedded/svd-microchip/SAMA5D2/ATSAMA5D29TA100.svd
            <register>
               <dim>4</dim>
               <dimIncrement>4</dimIncrement>
               <name>ST2RPQ[%s]</name>
               <description>Screening Type 2 Register Priority Queue (index = 0)</description>
               <addressOffset>0x540</addressOffset>
               <fields>
                  <field>
                     <name>QNB</name>
                     <description>Queue Number (0-2)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>VLANP</name>
                     <description>VLAN Priority</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>VLANE</name>
                     <description>VLAN Enable</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>VLANESelect</name>
                        <enumeratedValue>
                           <name>VLANE_0</name>
                           <description>VLAN match is disabled.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>VLANE_1</name>
                           <description>VLAN match is enabled.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>I2ETH</name>
                     <description>Index of Screening Type 2 EtherType register</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>ETHE</name>
                     <description>EtherType Enable</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>ETHESelect</name>
                        <enumeratedValue>
                           <name>ETHE_0</name>
                           <description>EtherType match with bits 15:0 in the register designated by the value of I2ETH is disabled.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ETHE_1</name>
                           <description>EtherType match with bits 15:0 in the register designated by the value of I2ETH is enabled.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>COMPA</name>
                     <description>Index of Screening Type 2 Compare Word 0/Word 1 register</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>COMPAE</name>
                     <description>Compare A Enable</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>COMPAESelect</name>
                        <enumeratedValue>
                           <name>COMPAE_0</name>
                           <description>Comparison via the register designated by index COMPA is disabled.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>COMPAE_1</name>
                           <description>Comparison via the register designated by index COMPA is enabled.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>COMPB</name>
                     <description>Index of Screening Type 2 Compare Word 0/Word 1 register</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>COMPBE</name>
                     <description>Compare B Enable</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>COMPBESelect</name>
                        <enumeratedValue>
                           <name>COMPBE_0</name>
                           <description>Comparison via the register designated by index COMPB is disabled.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>COMPBE_1</name>
                           <description>Comparison via the register designated by index COMPB is enabled.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>COMPC</name>
                     <description>Index of Screening Type 2 Compare Word 0/Word 1 register</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>COMPCE</name>
                     <description>Compare C Enable</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>COMPCESelect</name>
                        <enumeratedValue>
                           <name>COMPCE_0</name>
                           <description>Comparison via the register designated by index COMPC is disabled.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>COMPCE_1</name>
                           <description>Comparison via the register designated by index COMPC is enabled.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>TSCTL</name>
               <description>Transmit Schedule Control Register</description>
               <addressOffset>0x580</addressOffset>
               <fields>
                  <field>
                     <name>TXSQ0</name>
                     <description>Transmit Schedule for Qx</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>TXSQ0Select</name>
                        <enumeratedValue>
                           <name>FP</name>
                           <description>Fixed Priority</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CBS</name>
                           <description>CBS Enabled only valid for top two enabled queues and if CBS capability selected.</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DWRR</name>
                           <description>DWRR enabled</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ETS</name>
                           <description>ETS enabled</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TXSQ1</name>
                     <description>Transmit Schedule for Qx</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>2</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>TXSQ1Select</name>
                        <enumeratedValue>
                           <name>FP</name>
                           <description>Fixed Priority</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CBS</name>
                           <description>CBS Enabled only valid for top two enabled queues and if CBS capability selected.</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DWRR</name>
                           <description>DWRR enabled</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ETS</name>
                           <description>ETS enabled</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TXSQ2</name>
                     <description>Transmit Schedule for Qx</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>2</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>TXSQ2Select</name>
                        <enumeratedValue>
                           <name>FP</name>
                           <description>Fixed Priority</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CBS</name>
                           <description>CBS Enabled only valid for top two enabled queues and if CBS capability selected.</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DWRR</name>
                           <description>DWRR enabled</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ETS</name>
                           <description>ETS enabled</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>TQBWRL0</name>
               <description>Transmit Queue Bandwidth Rate Limit 0 Register</description>
               <addressOffset>0x590</addressOffset>
               <fields>
                  <field>
                     <name>ALLOCQ0</name>
                     <description>DWRR Weighting or ETS Bandwidth Allocation for Qx</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>ALLOCQ1</name>
                     <description>DWRR Weighting or ETS Bandwidth Allocation for Qx</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>ALLOCQ2</name>
                     <description>DWRR Weighting or ETS Bandwidth Allocation for Qx</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>TQSA</name>
               <description>Transmit Queue Segment Allocation Register</description>
               <addressOffset>0x5A0</addressOffset>
               <fields>
                  <field>
                     <name>SEGALLOCQ0</name>
                     <description>Segment Allocation for Qx</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>SEGALLOCQ1</name>
                     <description>Segment Allocation for Qx</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>SEGALLOCQ2</name>
                     <description>Segment Allocation for Qx</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>2</dim>
               <dimIncrement>4</dimIncrement>
               <name>IERPQ[%s]</name>
               <description>Interrupt Enable Register Priority Queue (index = 1)</description>
               <addressOffset>0x600</addressOffset>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>RCOMP</name>
                     <description>Receive Complete</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXUBR</name>
                     <description>RX Used Bit Read</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RLEX</name>
                     <description>Retry Limit Exceeded or Late Collision</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TFC</name>
                     <description>Transmit Frame Corruption Due to System Bus Error</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TCOMP</name>
                     <description>Transmit Complete</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>HRESP</name>
                     <description>System Bus Error</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>2</dim>
               <dimIncrement>4</dimIncrement>
               <name>IDRPQ[%s]</name>
               <description>Interrupt Disable Register Priority Queue (index = 1)</description>
               <addressOffset>0x620</addressOffset>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>RCOMP</name>
                     <description>Receive Complete</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXUBR</name>
                     <description>RX Used Bit Read</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RLEX</name>
                     <description>Retry Limit Exceeded or Late Collision</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TFC</name>
                     <description>Transmit Frame Corruption Due to System Bus Error</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TCOMP</name>
                     <description>Transmit Complete</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>HRESP</name>
                     <description>System Bus Error</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>2</dim>
               <dimIncrement>4</dimIncrement>
               <name>IMRPQ[%s]</name>
               <description>Interrupt Mask Register Priority Queue (index = 1)</description>
               <addressOffset>0x640</addressOffset>
               <fields>
                  <field>
                     <name>RCOMP</name>
                     <description>Receive Complete</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXUBR</name>
                     <description>RX Used Bit Read</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RLEX</name>
                     <description>Retry Limit Exceeded or Late Collision</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AHB</name>
                     <description>Transmit Frame Corruption Due to System Bus Error</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TCOMP</name>
                     <description>Transmit Complete</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>HRESP</name>
                     <description>System Bus Error</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>4</dim>
               <dimIncrement>4</dimIncrement>
               <name>ST2ER[%s]</name>
               <description>Screening Type 2 Ethertype Register (index = 0)</description>
               <addressOffset>0x6E0</addressOffset>
               <fields>
                  <field>
                     <name>COMPVAL</name>
                     <description>Ethertype Compare Value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <cluster>
               <dim>24</dim>
               <dimIncrement>0x08</dimIncrement>
               <name>GMAC_ST2CW[%s]</name>
               <description/>
               <addressOffset>0x700</addressOffset>
               <register>
                  <name>ST2CW0R</name>
                  <description>Screening Type 2 Compare Word 0 Register </description>
                  <addressOffset>0x0</addressOffset>
                  <fields>
                     <field>
                        <name>MASKVAL</name>
                        <description>Mask Value</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>16</bitWidth>
                     </field>
                     <field>
                        <name>COMPVAL</name>
                        <description>Compare Value</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>16</bitWidth>
                     </field>
                  </fields>
               </register>
