Ac6Embedded/svd-microchip/SAMA5D2/ATSAMA5D29TA100.svd
            <register>
               <name>NBTP</name>
               <description>Nominal Bit Timing and Prescaler Register</description>
               <addressOffset>0x1C</addressOffset>
               <fields>
                  <field>
                     <name>NTSEG2</name>
                     <description>Nominal Time Segment After Sample Point</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
                  <field>
                     <name>NTSEG1</name>
                     <description>Nominal Time Segment Before Sample Point</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>NBRP</name>
                     <description>Nominal Bit Rate Prescaler</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>9</bitWidth>
                  </field>
                  <field>
                     <name>NSJW</name>
                     <description>Nominal (Re) Synchronization Jump Width</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>TSCC</name>
               <description>Timestamp Counter Configuration Register</description>
               <addressOffset>0x20</addressOffset>
               <fields>
                  <field>
                     <name>TSS</name>
                     <description>Timestamp Select</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>TSSSelect</name>
                        <enumeratedValue>
                           <name>ALWAYS_0</name>
                           <description>Timestamp counter value always 0x0000</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TCP_INC</name>
                           <description>Timestamp counter value incremented according to TCP</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EXT_TIMESTAMP</name>
                           <description>External timestamp counter value used</description>
                           <value>0x2</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TCP</name>
                     <description>Timestamp Counter Prescaler</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>TSCV</name>
               <description>Timestamp Counter Value Register</description>
               <addressOffset>0x24</addressOffset>
               <fields>
                  <field>
                     <name>TSC</name>
                     <description>Timestamp Counter (cleared on write)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>TOCC</name>
               <description>Timeout Counter Configuration Register</description>
               <addressOffset>0x28</addressOffset>
               <fields>
                  <field>
                     <name>ETOC</name>
                     <description>Enable Timeout Counter</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>ETOCSelect</name>
                        <enumeratedValue>
                           <name>NO_TIMEOUT</name>
                           <description>Timeout Counter disabled.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TOS_CONTROLLED</name>
                           <description>Timeout Counter enabled.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TOS</name>
                     <description>Timeout Select</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>2</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>TOSSelect</name>
                        <enumeratedValue>
                           <name>CONTINUOUS</name>
                           <description>Continuous operation</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TX_EV_TIMEOUT</name>
                           <description>Timeout controlled by Tx Event FIFO</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RX0_EV_TIMEOUT</name>
                           <description>Timeout controlled by Receive FIFO 0</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RX1_EV_TIMEOUT</name>
                           <description>Timeout controlled by Receive FIFO 1</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TOP</name>
                     <description>Timeout Period</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>TOCV</name>
               <description>Timeout Counter Value Register</description>
               <addressOffset>0x2C</addressOffset>
               <fields>
                  <field>
                     <name>TOC</name>
                     <description>Timeout Counter (cleared on write)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>ECR</name>
               <description>Error Counter Register</description>
               <addressOffset>0x40</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>TEC</name>
                     <description>Transmit Error Counter</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>REC</name>
                     <description>Receive Error Counter</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
                  <field>
                     <name>RP</name>
                     <description>Receive Error Passive</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CEL</name>
                     <description>CAN Error Logging (cleared on read)</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PSR</name>
               <description>Protocol Status Register</description>
               <addressOffset>0x44</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>LEC</name>
                     <description>Last Error Code (set to 111 on read)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>LECSelect</name>
                        <enumeratedValue>
                           <name>NO_ERROR</name>
                           <description>No error occurred since LEC has been reset by successful reception or transmission.</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>STUFF_ERROR</name>
                           <description>More than 5 equal bits in a sequence have occurred in a part of a received message where this is not allowed.</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FORM_ERROR</name>
                           <description>A fixed format part of a received frame has the wrong format.</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ACK_ERROR</name>
                           <description>The message transmitted by the MCAN was not acknowledged by another node.</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>BIT1_ERROR</name>
                           <description>During transmission of a message (with the exception of the arbitration field), the device tried to send a recessive level (bit of logical value '1'), but the monitored bus value was dominant.</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>BIT0_ERROR</name>
                           <description>During transmission of a message (or acknowledge bit, or active error flag, or overload flag), the device tried to send a dominant level (data or identifier bit logical value '0'), but the monitored bus value was recessive. During Bus_Off recovery, this status is set each time a sequence of 11 recessive bits has been monitored. This enables the processor to monitor the proceeding of the Bus_Off recovery sequence (indicating the bus is not stuck at dominant or continuously disturbed).</description>
                           <value>0x5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CRC_ERROR</name>
                           <description>The CRC check sum of a received message was incorrect. The CRC of an incoming message does not match the CRC calculated from the received data.</description>
                           <value>0x6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>NO_CHANGE</name>
                           <description>Any read access to the Protocol Status Register re-initializes the LEC to '7'. When the LEC shows value '7', no CAN bus event was detected since the last processor read access to the Protocol Status Register.</description>
                           <value>0x7</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ACT</name>
                     <description>Activity</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>2</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>ACTSelect</name>
                        <enumeratedValue>
                           <name>SYNCHRONIZING</name>
                           <description>Node is synchronizing on CAN communication</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>IDLE</name>
                           <description>Node is neither receiver nor transmitter</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RECEIVER</name>
                           <description>Node is operating as receiver</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TRANSMITTER</name>
                           <description>Node is operating as transmitter</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>EP</name>
                     <description>Error Passive</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EW</name>
                     <description>Warning Status</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BO</name>
                     <description>Bus_Off Status</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DLEC</name>
                     <description>Data Phase Last Error Code (set to 111 on read)</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>RESI</name>
                     <description>ESI Flag of Last Received CAN FD Message (cleared on read)</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RBRS</name>
                     <description>BRS Flag of Last Received CAN FD Message (cleared on read)</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RFDF</name>
                     <description>Received a CAN FD Message (cleared on read)</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PXE</name>
                     <description>Protocol Exception Event (cleared on read)</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TDCV</name>
                     <description>Transmitter Delay Compensation Value</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>TDCR</name>
               <description>Transmit Delay Compensation Register</description>
               <addressOffset>0x48</addressOffset>
               <fields>
                  <field>
                     <name>TDCF</name>
                     <description>Transmitter Delay Compensation Filter</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
                  <field>
                     <name>TDCO</name>
                     <description>Transmitter Delay Compensation Offset</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
               </fields>
            </register>
