Ac6Embedded/svd-microchip/SAMA5D2/ATSAMA5D29TA100.svd
            <register>
               <name>GFC</name>
               <description>Global Filter Configuration Register</description>
               <addressOffset>0x80</addressOffset>
               <fields>
                  <field>
                     <name>RRFE</name>
                     <description>Reject Remote Frames Extended</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>RRFESelect</name>
                        <enumeratedValue>
                           <name>FILTER</name>
                           <description>Filter remote frames with 29-bit extended IDs.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>REJECT</name>
                           <description>Reject all remote frames with 29-bit extended IDs.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>RRFS</name>
                     <description>Reject Remote Frames Standard</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>RRFSSelect</name>
                        <enumeratedValue>
                           <name>FILTER</name>
                           <description>Filter remote frames with 11-bit standard IDs.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>REJECT</name>
                           <description>Reject all remote frames with 11-bit standard IDs.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ANFE</name>
                     <description>Accept Non-matching Frames Extended</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>2</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>ANFESelect</name>
                        <enumeratedValue>
                           <name>RX_FIFO_0</name>
                           <description>Accept in Rx FIFO 0</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RX_FIFO_1</name>
                           <description>Accept in Rx FIFO 1</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ANFS</name>
                     <description>Accept Non-matching Frames Standard</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>2</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>ANFSSelect</name>
                        <enumeratedValue>
                           <name>RX_FIFO_0</name>
                           <description>Accept in Rx FIFO 0</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RX_FIFO_1</name>
                           <description>Accept in Rx FIFO 1</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>SIDFC</name>
               <description>Standard ID Filter Configuration Register</description>
               <addressOffset>0x84</addressOffset>
               <fields>
                  <field>
                     <name>FLSSA</name>
                     <description>Filter List Standard Start Address</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>14</bitWidth>
                  </field>
                  <field>
                     <name>LSS</name>
                     <description>List Size Standard</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>XIDFC</name>
               <description>Extended ID Filter Configuration Register</description>
               <addressOffset>0x88</addressOffset>
               <fields>
                  <field>
                     <name>FLESA</name>
                     <description>Filter List Extended Start Address</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>14</bitWidth>
                  </field>
                  <field>
                     <name>LSE</name>
                     <description>List Size Extended</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>XIDAM</name>
               <description>Extended ID AND Mask Register</description>
               <addressOffset>0x90</addressOffset>
               <fields>
                  <field>
                     <name>EIDM</name>
                     <description>Extended ID Mask</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>29</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HPMS</name>
               <description>High Priority Message Status Register</description>
               <addressOffset>0x94</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>BIDX</name>
                     <description>Buffer Index</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
                  <field>
                     <name>MSI</name>
                     <description>Message Storage Indicator</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>2</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>MSISelect</name>
                        <enumeratedValue>
                           <name>NO_FIFO_SEL</name>
                           <description>No FIFO selected.</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LOST</name>
                           <description>FIFO message lost.</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FIFO_0</name>
                           <description>Message stored in FIFO 0.</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FIFO_1</name>
                           <description>Message stored in FIFO 1.</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>FIDX</name>
                     <description>Filter Index</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
                  <field>
                     <name>FLST</name>
                     <description>Filter List</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>NDAT1</name>
               <description>New Data 1 Register</description>
               <addressOffset>0x98</addressOffset>
               <fields>
                  <field>
                     <name>ND0</name>
                     <description>New Data</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ND1</name>
                     <description>New Data</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ND2</name>
                     <description>New Data</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ND3</name>
                     <description>New Data</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ND4</name>
                     <description>New Data</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ND5</name>
                     <description>New Data</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ND6</name>
                     <description>New Data</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ND7</name>
                     <description>New Data</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ND8</name>
                     <description>New Data</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ND9</name>
                     <description>New Data</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ND10</name>
                     <description>New Data</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ND11</name>
                     <description>New Data</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ND12</name>
                     <description>New Data</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ND13</name>
                     <description>New Data</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ND14</name>
                     <description>New Data</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ND15</name>
                     <description>New Data</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ND16</name>
                     <description>New Data</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ND17</name>
                     <description>New Data</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ND18</name>
                     <description>New Data</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ND19</name>
                     <description>New Data</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ND20</name>
                     <description>New Data</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ND21</name>
                     <description>New Data</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ND22</name>
                     <description>New Data</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ND23</name>
                     <description>New Data</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ND24</name>
                     <description>New Data</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ND25</name>
                     <description>New Data</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ND26</name>
                     <description>New Data</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ND27</name>
                     <description>New Data</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ND28</name>
                     <description>New Data</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ND29</name>
                     <description>New Data</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ND30</name>
                     <description>New Data</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ND31</name>
                     <description>New Data</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
