Ac6Embedded/svd-microchip/SAMA5D2/ATSAMA5D29TA100.svd
            <register>
               <name>RXESC</name>
               <description>Receive Buffer / FIFO Element Size Configuration Register</description>
               <addressOffset>0xBC</addressOffset>
               <fields>
                  <field>
                     <name>F0DS</name>
                     <description>Receive FIFO 0 Data Field Size</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>F0DSSelect</name>
                        <enumeratedValue>
                           <name>_8_BYTE</name>
                           <description>8-byte data field</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_12_BYTE</name>
                           <description>12-byte data field</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_16_BYTE</name>
                           <description>16-byte data field</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_20_BYTE</name>
                           <description>20-byte data field</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_24_BYTE</name>
                           <description>24-byte data field</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_32_BYTE</name>
                           <description>32-byte data field</description>
                           <value>0x5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_48_BYTE</name>
                           <description>48-byte data field</description>
                           <value>0x6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_64_BYTE</name>
                           <description>64-byte data field</description>
                           <value>0x7</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>F1DS</name>
                     <description>Receive FIFO 1 Data Field Size</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>3</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>F1DSSelect</name>
                        <enumeratedValue>
                           <name>_8_BYTE</name>
                           <description>8-byte data field</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_12_BYTE</name>
                           <description>12-byte data field</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_16_BYTE</name>
                           <description>16-byte data field</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_20_BYTE</name>
                           <description>20-byte data field</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_24_BYTE</name>
                           <description>24-byte data field</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_32_BYTE</name>
                           <description>32-byte data field</description>
                           <value>0x5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_48_BYTE</name>
                           <description>48-byte data field</description>
                           <value>0x6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_64_BYTE</name>
                           <description>64-byte data field</description>
                           <value>0x7</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>RBDS</name>
                     <description>Receive Buffer Data Field Size</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>3</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>RBDSSelect</name>
                        <enumeratedValue>
                           <name>_8_BYTE</name>
                           <description>8-byte data field</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_12_BYTE</name>
                           <description>12-byte data field</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_16_BYTE</name>
                           <description>16-byte data field</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_20_BYTE</name>
                           <description>20-byte data field</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_24_BYTE</name>
                           <description>24-byte data field</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_32_BYTE</name>
                           <description>32-byte data field</description>
                           <value>0x5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_48_BYTE</name>
                           <description>48-byte data field</description>
                           <value>0x6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_64_BYTE</name>
                           <description>64-byte data field</description>
                           <value>0x7</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>TXBC</name>
               <description>Transmit Buffer Configuration Register</description>
               <addressOffset>0xC0</addressOffset>
               <fields>
                  <field>
                     <name>TBSA</name>
                     <description>Tx Buffers Start Address</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>14</bitWidth>
                  </field>
                  <field>
                     <name>NDTB</name>
                     <description>Number of Dedicated Transmit Buffers</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
                  <field>
                     <name>TFQS</name>
                     <description>Transmit FIFO/Queue Size</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
                  <field>
                     <name>TFQM</name>
                     <description>Tx FIFO/Queue Mode</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>TXFQS</name>
               <description>Transmit FIFO/Queue Status Register</description>
               <addressOffset>0xC4</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>TFFL</name>
                     <description>Tx FIFO Free Level</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
                  <field>
                     <name>TFGI</name>
                     <description>Tx FIFO Get Index</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>TFQPI</name>
                     <description>Tx FIFO/Queue Put Index</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>TFQF</name>
                     <description>Tx FIFO/Queue Full</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>TXESC</name>
               <description>Transmit Buffer Element Size Configuration Register</description>
               <addressOffset>0xC8</addressOffset>
               <fields>
                  <field>
                     <name>TBDS</name>
                     <description>Tx Buffer Data Field Size</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>TBDSSelect</name>
                        <enumeratedValue>
                           <name>_8_BYTE</name>
                           <description>8-byte data field</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_12_BYTE</name>
                           <description>12-byte data field</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_16_BYTE</name>
                           <description>16-byte data field</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_20_BYTE</name>
                           <description>20-byte data field</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_24_BYTE</name>
                           <description>24-byte data field</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_32_BYTE</name>
                           <description>32-byte data field</description>
                           <value>0x5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_48_BYTE</name>
                           <description>48- byte data field</description>
                           <value>0x6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_64_BYTE</name>
                           <description>64-byte data field</description>
                           <value>0x7</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>TXBRP</name>
               <description>Transmit Buffer Request Pending Register</description>
               <addressOffset>0xCC</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>TRP0</name>
                     <description>Transmission Request Pending for Buffer 0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TRP1</name>
                     <description>Transmission Request Pending for Buffer 1</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TRP2</name>
                     <description>Transmission Request Pending for Buffer 2</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TRP3</name>
                     <description>Transmission Request Pending for Buffer 3</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TRP4</name>
                     <description>Transmission Request Pending for Buffer 4</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TRP5</name>
                     <description>Transmission Request Pending for Buffer 5</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TRP6</name>
                     <description>Transmission Request Pending for Buffer 6</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TRP7</name>
                     <description>Transmission Request Pending for Buffer 7</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TRP8</name>
                     <description>Transmission Request Pending for Buffer 8</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TRP9</name>
                     <description>Transmission Request Pending for Buffer 9</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TRP10</name>
                     <description>Transmission Request Pending for Buffer 10</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TRP11</name>
                     <description>Transmission Request Pending for Buffer 11</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TRP12</name>
                     <description>Transmission Request Pending for Buffer 12</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TRP13</name>
                     <description>Transmission Request Pending for Buffer 13</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TRP14</name>
                     <description>Transmission Request Pending for Buffer 14</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TRP15</name>
                     <description>Transmission Request Pending for Buffer 15</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TRP16</name>
                     <description>Transmission Request Pending for Buffer 16</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TRP17</name>
                     <description>Transmission Request Pending for Buffer 17</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TRP18</name>
                     <description>Transmission Request Pending for Buffer 18</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TRP19</name>
                     <description>Transmission Request Pending for Buffer 19</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TRP20</name>
                     <description>Transmission Request Pending for Buffer 20</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TRP21</name>
                     <description>Transmission Request Pending for Buffer 21</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TRP22</name>
                     <description>Transmission Request Pending for Buffer 22</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TRP23</name>
                     <description>Transmission Request Pending for Buffer 23</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TRP24</name>
                     <description>Transmission Request Pending for Buffer 24</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TRP25</name>
                     <description>Transmission Request Pending for Buffer 25</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TRP26</name>
                     <description>Transmission Request Pending for Buffer 26</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TRP27</name>
                     <description>Transmission Request Pending for Buffer 27</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TRP28</name>
                     <description>Transmission Request Pending for Buffer 28</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TRP29</name>
                     <description>Transmission Request Pending for Buffer 29</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TRP30</name>
                     <description>Transmission Request Pending for Buffer 30</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TRP31</name>
                     <description>Transmission Request Pending for Buffer 31</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
