Ac6Embedded/svd-microchip/SAMA5D2/ATSAMA5D29TA100.svd
            <register>
               <name>TXBAR</name>
               <description>Transmit Buffer Add Request Register</description>
               <addressOffset>0xD0</addressOffset>
               <fields>
                  <field>
                     <name>AR0</name>
                     <description>Add Request for Transmit Buffer 0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AR1</name>
                     <description>Add Request for Transmit Buffer 1</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AR2</name>
                     <description>Add Request for Transmit Buffer 2</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AR3</name>
                     <description>Add Request for Transmit Buffer 3</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AR4</name>
                     <description>Add Request for Transmit Buffer 4</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AR5</name>
                     <description>Add Request for Transmit Buffer 5</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AR6</name>
                     <description>Add Request for Transmit Buffer 6</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AR7</name>
                     <description>Add Request for Transmit Buffer 7</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AR8</name>
                     <description>Add Request for Transmit Buffer 8</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AR9</name>
                     <description>Add Request for Transmit Buffer 9</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AR10</name>
                     <description>Add Request for Transmit Buffer 10</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AR11</name>
                     <description>Add Request for Transmit Buffer 11</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AR12</name>
                     <description>Add Request for Transmit Buffer 12</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AR13</name>
                     <description>Add Request for Transmit Buffer 13</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AR14</name>
                     <description>Add Request for Transmit Buffer 14</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AR15</name>
                     <description>Add Request for Transmit Buffer 15</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AR16</name>
                     <description>Add Request for Transmit Buffer 16</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AR17</name>
                     <description>Add Request for Transmit Buffer 17</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AR18</name>
                     <description>Add Request for Transmit Buffer 18</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AR19</name>
                     <description>Add Request for Transmit Buffer 19</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AR20</name>
                     <description>Add Request for Transmit Buffer 20</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AR21</name>
                     <description>Add Request for Transmit Buffer 21</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AR22</name>
                     <description>Add Request for Transmit Buffer 22</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AR23</name>
                     <description>Add Request for Transmit Buffer 23</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AR24</name>
                     <description>Add Request for Transmit Buffer 24</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AR25</name>
                     <description>Add Request for Transmit Buffer 25</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AR26</name>
                     <description>Add Request for Transmit Buffer 26</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AR27</name>
                     <description>Add Request for Transmit Buffer 27</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AR28</name>
                     <description>Add Request for Transmit Buffer 28</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AR29</name>
                     <description>Add Request for Transmit Buffer 29</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AR30</name>
                     <description>Add Request for Transmit Buffer 30</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AR31</name>
                     <description>Add Request for Transmit Buffer 31</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>TXBCR</name>
               <description>Transmit Buffer Cancellation Request Register</description>
               <addressOffset>0xD4</addressOffset>
               <fields>
                  <field>
                     <name>CR0</name>
                     <description>Cancellation Request for Transmit Buffer 0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CR1</name>
                     <description>Cancellation Request for Transmit Buffer 1</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CR2</name>
                     <description>Cancellation Request for Transmit Buffer 2</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CR3</name>
                     <description>Cancellation Request for Transmit Buffer 3</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CR4</name>
                     <description>Cancellation Request for Transmit Buffer 4</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CR5</name>
                     <description>Cancellation Request for Transmit Buffer 5</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CR6</name>
                     <description>Cancellation Request for Transmit Buffer 6</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CR7</name>
                     <description>Cancellation Request for Transmit Buffer 7</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CR8</name>
                     <description>Cancellation Request for Transmit Buffer 8</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CR9</name>
                     <description>Cancellation Request for Transmit Buffer 9</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CR10</name>
                     <description>Cancellation Request for Transmit Buffer 10</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CR11</name>
                     <description>Cancellation Request for Transmit Buffer 11</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CR12</name>
                     <description>Cancellation Request for Transmit Buffer 12</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CR13</name>
                     <description>Cancellation Request for Transmit Buffer 13</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CR14</name>
                     <description>Cancellation Request for Transmit Buffer 14</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CR15</name>
                     <description>Cancellation Request for Transmit Buffer 15</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CR16</name>
                     <description>Cancellation Request for Transmit Buffer 16</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CR17</name>
                     <description>Cancellation Request for Transmit Buffer 17</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CR18</name>
                     <description>Cancellation Request for Transmit Buffer 18</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CR19</name>
                     <description>Cancellation Request for Transmit Buffer 19</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CR20</name>
                     <description>Cancellation Request for Transmit Buffer 20</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CR21</name>
                     <description>Cancellation Request for Transmit Buffer 21</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CR22</name>
                     <description>Cancellation Request for Transmit Buffer 22</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CR23</name>
                     <description>Cancellation Request for Transmit Buffer 23</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CR24</name>
                     <description>Cancellation Request for Transmit Buffer 24</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CR25</name>
                     <description>Cancellation Request for Transmit Buffer 25</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CR26</name>
                     <description>Cancellation Request for Transmit Buffer 26</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CR27</name>
                     <description>Cancellation Request for Transmit Buffer 27</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CR28</name>
                     <description>Cancellation Request for Transmit Buffer 28</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CR29</name>
                     <description>Cancellation Request for Transmit Buffer 29</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CR30</name>
                     <description>Cancellation Request for Transmit Buffer 30</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CR31</name>
                     <description>Cancellation Request for Transmit Buffer 31</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
