Ac6Embedded/svd-microchip/SAMA5D2/ATSAMA5D29TA100.svd
            <register>
               <name>TSU_TSCFG</name>
               <description>TSU Timestamp Configuration Register</description>
               <addressOffset>0x164</addressOffset>
               <fields>
                  <field>
                     <name>TSUE</name>
                     <description>Timestamp Unit Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>TSUESelect</name>
                        <enumeratedValue>
                           <name>TSUE_0</name>
                           <description>TSU disabled</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TSUE_1</name>
                           <description>TSU enabled</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TBCS</name>
                     <description>Timebase Counter Select</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>TBCSSelect</name>
                        <enumeratedValue>
                           <name>TBCS_0</name>
                           <description>Timestamp value captured from internal timebase counter (32 bits)</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TBCS_1</name>
                           <description>Timestamp value captured from external timebase counter (32 bits)</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SCP</name>
                     <description>Select Capturing Position</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>SCPSelect</name>
                        <enumeratedValue>
                           <name>SCP_0</name>
                           <description>Timestamp captured at EOF.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SCP_1</name>
                           <description>Timestamp captured at SOF.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TBPRE</name>
                     <description>Timebase Prescaler</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>TSU_TSS1</name>
               <description>TSU Timestamp Status 1 Register</description>
               <addressOffset>0x168</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>TSN</name>
                     <description>Timestamp New</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>TSL</name>
                     <description>Timestamp Lost</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>TSU_TSS2</name>
               <description>TSU Timestamp Status 2 Register</description>
               <addressOffset>0x16C</addressOffset>
               <access>read-only</access>
               <resetValue>0x0000E000</resetValue>
               <fields>
                  <field>
                     <name>TSP</name>
                     <description>Timestamp Pointer</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>NTSG</name>
                     <description>Number of Timestamps Generic</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>ITBG</name>
                     <description>Internal Timebase and SOF Select Generic</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>16</dim>
               <dimIncrement>4</dimIncrement>
               <name>TSU_TS[%s]</name>
               <description>TSU Timestamp x Register</description>
               <addressOffset>0x170</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>TS</name>
                     <description>Timestamp Word TS</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>TSU_ATB</name>
               <description>TSU Actual Timebase Register</description>
               <addressOffset>0x1B0</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>TB</name>
                     <description>Timebase for Timestamp Generation</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
