Ac6Embedded/svd-microchip/SAMA5D2/ATSAMA5D29TA100.svd
         </registers>
      </peripheral>
      <peripheral derivedFrom="MCAN0">
         <name>MCAN1</name>
         <baseAddress>0xFC050000</baseAddress>
         <interrupt>
            <name>MCAN1_INT0</name>
            <description>Internal MCAN 1 Interrupt 0</description>
            <value>57</value>
         </interrupt>
         <interrupt>
            <name>MCAN1_INT1</name>
            <description>Internal MCAN 1 Interrupt 1</description>
            <value>65</value>
         </interrupt>
      </peripheral>
      <peripheral>
         <name>MPDDRC</name>
         <version>11043ZA</version>
         <description>AHB Multiport DDR-SDRAM Controller</description>
         <baseAddress>0xF000C000</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0xEC</size>
            <usage>registers</usage>
         </addressBlock>
         <interrupt>
            <name>MPDDRC</name>
            <description>MPDDR Controller</description>
            <value>13</value>
         </interrupt>
         <registers>
            <register>
               <name>MR</name>
               <description>Mode Register</description>
               <addressOffset>0x00</addressOffset>
               <fields>
                  <field>
                     <name>MODE</name>
                     <description>MPDDRC Command Mode</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>MODESelect</name>
                        <enumeratedValue>
                           <name>NORMAL_CMD</name>
                           <description>Normal Mode. Any access to the MPDDRC is decoded normally. To activate this mode, the command must be followed by a write to the DDR-SDRAM.</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>NOP_CMD</name>
                           <description>The MPDDRC issues a NOP command when the DDR-SDRAM device is accessed regardless of the cycle. To activate this mode, the command must be followed by a write to the DDR-SDRAM.</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PRCGALL_CMD</name>
                           <description>The MPDDRC issues the All Banks Precharge command when the DDR-SDRAM device is accessed regardless of the cycle. To activate this mode, the command must be followed by a write to the SDRAM.</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LMR_CMD</name>
                           <description>The MPDDRC issues a Load Mode Register command when the DDR-SDRAM device is accessed regardless of the cycle. To activate this mode, the command must be followed by a write to the DDR-SDRAM.</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RFSH_CMD</name>
                           <description>The MPDDRC issues an Autorefresh command when the DDR-SDRAM device is accessed regardless of the cycle. Previously, an All Banks Precharge command must be issued. To activate this mode, the command must be followed by a write to the DDR-SDRAM.</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EXT_LMR_CMD</name>
                           <description>The MPDDRC issues an Extended Load Mode Register command when the SDRAM device is accessed regardless of the cycle. To activate this mode, the command must be followed by a write to the DDR-SDRAM. The write in the DDR-SDRAM must be done in the appropriate bank.</description>
                           <value>0x5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DEEP_CALIB_MD</name>
                           <description>Deep Power mode: Access to Deep Powerdown modeCalibration command: to calibrate RTT and RON values for the Process Voltage Temperature (PVT) (DDR3-SDRAM device)</description>
                           <value>0x6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LPDDR2_LPDDR3_CMD</name>
                           <description>The MPDDRC issues an LPDDR2/LPDDR3 Mode Register command when the device is accessed regardless of the cycle. To activate this mode, the Mode Register command must be followed by a write to the low-power DDR2-SDRAM or to the low-power DDR3-SDRAM.</description>
                           <value>0x7</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DAI</name>
                     <description>Device Autoinitialization Status (read-only)</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>DAISelect</name>
                        <enumeratedValue>
                           <name>DAI_COMPLETE</name>
                           <description>DAI complete</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DAI_IN_PROGESSS</name>
                           <description>DAI still in progress</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>MRS</name>
                     <description>Mode Register Select LPDDR2/LPDDR3</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>RTR</name>
               <description>Refresh Timer Register</description>
               <addressOffset>0x04</addressOffset>
               <fields>
                  <field>
                     <name>COUNT</name>
                     <description>MPDDRC Refresh Timer Count</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>12</bitWidth>
                  </field>
                  <field>
                     <name>ADJ_REF</name>
                     <description>Adjust Refresh Rate</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>REF_PB</name>
                     <description>Refresh Per Bank</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MR4_VALUE</name>
                     <description>Content of MR4 Register (read-only)</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
               </fields>
            </register>
