Ac6Embedded/svd-microchip/SAMA5D2/ATSAMA5D29TA100.svd
            <register>
               <name>MCFGR</name>
               <description>Monitor Configuration Register</description>
               <addressOffset>0x60</addressOffset>
               <fields>
                  <field>
                     <name>EN_MONI</name>
                     <description>Enable Monitor</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SOFT_RESET</name>
                     <description>Soft Reset</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RUN</name>
                     <description>Control Monitor</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>READ_WRITE</name>
                     <description>Read/Write Access</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>2</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>READ_WRITESelect</name>
                        <enumeratedValue>
                           <name>TRIG_RD_WR</name>
                           <description>Read and Write accesses are triggered.</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TRIG_WR</name>
                           <description>Only Write accesses are triggered.</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TRIG_RD</name>
                           <description>Only Read accesses are triggered.</description>
                           <value>0x2</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>REFR_CALIB</name>
                     <description>Refresh Calibration</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>INFO</name>
                     <description>Information Type</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>2</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>INFOSelect</name>
                        <enumeratedValue>
                           <name>MAX_WAIT</name>
                           <description>Information concerning the transfer with the longest waiting time</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>NB_TRANSFERS</name>
                           <description>Number of transfers on the port</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TOTAL_LATENCY</name>
                           <description>Total latency on the port</description>
                           <value>0x2</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>MADDR0</name>
               <description>Monitor Address High/Low Port 0 Register</description>
               <addressOffset>0x64</addressOffset>
               <fields>
                  <field>
                     <name>ADDR_LOW_PORT0</name>
                     <description>Address Low on Port x [x = 0..7]</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>ADDR_HIGH_PORT0</name>
                     <description>Address High on Port x [x = 0..7]</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MADDR1</name>
               <description>Monitor Address High/Low Port 1 Register</description>
               <addressOffset>0x68</addressOffset>
               <fields>
                  <field>
                     <name>ADDR_LOW_PORT1</name>
                     <description>Address Low on Port x [x = 0..7]</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>ADDR_HIGH_PORT1</name>
                     <description>Address High on Port x [x = 0..7]</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MADDR2</name>
               <description>Monitor Address High/Low Port 2 Register</description>
               <addressOffset>0x6C</addressOffset>
               <fields>
                  <field>
                     <name>ADDR_LOW_PORT2</name>
                     <description>Address Low on Port x [x = 0..7]</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>ADDR_HIGH_PORT2</name>
                     <description>Address High on Port x [x = 0..7]</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MADDR3</name>
               <description>Monitor Address High/Low Port 3 Register</description>
               <addressOffset>0x70</addressOffset>
               <fields>
                  <field>
                     <name>ADDR_LOW_PORT3</name>
                     <description>Address Low on Port x [x = 0..7]</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>ADDR_HIGH_PORT3</name>
                     <description>Address High on Port x [x = 0..7]</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MADDR4</name>
               <description>Monitor Address High/Low Port 4 Register</description>
               <addressOffset>0x74</addressOffset>
               <fields>
                  <field>
                     <name>ADDR_LOW_PORT4</name>
                     <description>Address Low on Port x [x = 0..7]</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>ADDR_HIGH_PORT4</name>
                     <description>Address High on Port x [x = 0..7]</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MADDR5</name>
               <description>Monitor Address High/Low Port 5 Register</description>
               <addressOffset>0x78</addressOffset>
               <fields>
                  <field>
                     <name>ADDR_LOW_PORT5</name>
                     <description>Address Low on Port x [x = 0..7]</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>ADDR_HIGH_PORT5</name>
                     <description>Address High on Port x [x = 0..7]</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MADDR6</name>
               <description>Monitor Address High/Low Port 6 Register</description>
               <addressOffset>0x7C</addressOffset>
               <fields>
                  <field>
                     <name>ADDR_LOW_PORT6</name>
                     <description>Address Low on Port x [x = 0..7]</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>ADDR_HIGH_PORT6</name>
                     <description>Address High on Port x [x = 0..7]</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MADDR7</name>
               <description>Monitor Address High/Low Port 7 Register</description>
               <addressOffset>0x80</addressOffset>
               <fields>
                  <field>
                     <name>ADDR_LOW_PORT7</name>
                     <description>Address Low on Port x [x = 0..7]</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>ADDR_HIGH_PORT7</name>
                     <description>Address High on Port x [x = 0..7]</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MINFO0_MAX_WAIT_MODE</name>
               <description>Monitor Information Port 0 Register</description>
               <addressOffset>0x84</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>MAX_PORT0_WAITING</name>
                     <description>Address High on Port x [x = 0..7]</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>BURST</name>
                     <description>Type of Burst on Port x [x = 0..7]</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>3</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>BURSTSelect</name>
                        <enumeratedValue>
                           <name>SINGLE</name>
                           <description>Single transfer</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>INCR</name>
                           <description>Incrementing burst of unspecified length</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>WRAP4</name>
                           <description>4-beat wrapping burst</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>INCR4</name>
                           <description>4-beat incrementing burst</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>WRAP8</name>
                           <description>8-beat wrapping burst</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>INCR8</name>
                           <description>8-beat incrementing burst</description>
                           <value>0x5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>WRAP16</name>
                           <description>16-beat wrapping burst</description>
                           <value>0x6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>INCR16</name>
                           <description>16-beat incrementing burst</description>
                           <value>0x7</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SIZE</name>
                     <description>Transfer Size on Port x [x = 0..7]</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>3</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>SIZESelect</name>
                        <enumeratedValue>
                           <name>_8BITS</name>
                           <description>Byte transfer</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_16BITS</name>
                           <description>Halfword transfer</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_32BITS</name>
                           <description>Word transfer</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_64BITS</name>
                           <description>Dword transfer</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>READ_WRITE</name>
                     <description>Read or Write Access on Port x [x = 0..7]</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MINFO0_NB_TRANSFERS_MODE</name>
               <description>Monitor Information Port 0 Register</description>
               <alternateRegister>MINFO0_MAX_WAIT_MODE</alternateRegister>
               <addressOffset>0x84</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>P0_NB_TRANSFERS</name>
                     <description>Number of Transfers on Port x [x = 0..7]</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MINFO0_TOTAL_LATENCY_MODE</name>
               <description>Monitor Information Port 0 Register</description>
               <alternateRegister>MINFO0_MAX_WAIT_MODE</alternateRegister>
               <addressOffset>0x84</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>P0_TOTAL_LATENCY</name>
                     <description>Total Latency on Port x [x = 0..7]</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MINFO1_MAX_WAIT_MODE</name>
               <description>Monitor Information Port 1 Register</description>
               <addressOffset>0x88</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>MAX_PORT1_WAITING</name>
                     <description>Address High on Port x [x = 0..7]</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>BURST</name>
                     <description>Type of Burst on Port x [x = 0..7]</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>3</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>BURSTSelect</name>
                        <enumeratedValue>
                           <name>SINGLE</name>
                           <description>Single transfer</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>INCR</name>
                           <description>Incrementing burst of unspecified length</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>WRAP4</name>
                           <description>4-beat wrapping burst</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>INCR4</name>
                           <description>4-beat incrementing burst</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>WRAP8</name>
                           <description>8-beat wrapping burst</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>INCR8</name>
                           <description>8-beat incrementing burst</description>
                           <value>0x5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>WRAP16</name>
                           <description>16-beat wrapping burst</description>
                           <value>0x6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>INCR16</name>
                           <description>16-beat incrementing burst</description>
                           <value>0x7</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SIZE</name>
                     <description>Transfer Size on Port x [x = 0..7]</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>3</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>SIZESelect</name>
                        <enumeratedValue>
                           <name>_8BITS</name>
                           <description>Byte transfer</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_16BITS</name>
                           <description>Halfword transfer</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_32BITS</name>
                           <description>Word transfer</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_64BITS</name>
                           <description>Dword transfer</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>READ_WRITE</name>
                     <description>Read or Write Access on Port x [x = 0..7]</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MINFO1_NB_TRANSFERS_MODE</name>
               <description>Monitor Information Port 1 Register</description>
               <alternateRegister>MINFO1_MAX_WAIT_MODE</alternateRegister>
               <addressOffset>0x88</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>P1_NB_TRANSFERS</name>
                     <description>Number of Transfers on Port x [x = 0..7]</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MINFO1_TOTAL_LATENCY_MODE</name>
               <description>Monitor Information Port 1 Register</description>
               <alternateRegister>MINFO1_MAX_WAIT_MODE</alternateRegister>
               <addressOffset>0x88</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>P1_TOTAL_LATENCY</name>
                     <description>Total Latency on Port x [x = 0..7]</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
