Ac6Embedded/svd-microchip/SAMA5D2/ATSAMA5D29TA100.svd
            <register>
               <name>MINFO2_MAX_WAIT_MODE</name>
               <description>Monitor Information Port 2 Register</description>
               <addressOffset>0x8C</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>MAX_PORT2_WAITING</name>
                     <description>Address High on Port x [x = 0..7]</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>BURST</name>
                     <description>Type of Burst on Port x [x = 0..7]</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>3</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>BURSTSelect</name>
                        <enumeratedValue>
                           <name>SINGLE</name>
                           <description>Single transfer</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>INCR</name>
                           <description>Incrementing burst of unspecified length</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>WRAP4</name>
                           <description>4-beat wrapping burst</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>INCR4</name>
                           <description>4-beat incrementing burst</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>WRAP8</name>
                           <description>8-beat wrapping burst</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>INCR8</name>
                           <description>8-beat incrementing burst</description>
                           <value>0x5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>WRAP16</name>
                           <description>16-beat wrapping burst</description>
                           <value>0x6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>INCR16</name>
                           <description>16-beat incrementing burst</description>
                           <value>0x7</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SIZE</name>
                     <description>Transfer Size on Port x [x = 0..7]</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>3</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>SIZESelect</name>
                        <enumeratedValue>
                           <name>_8BITS</name>
                           <description>Byte transfer</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_16BITS</name>
                           <description>Halfword transfer</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_32BITS</name>
                           <description>Word transfer</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_64BITS</name>
                           <description>Dword transfer</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>READ_WRITE</name>
                     <description>Read or Write Access on Port x [x = 0..7]</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MINFO2_NB_TRANSFERS_MODE</name>
               <description>Monitor Information Port 2 Register</description>
               <alternateRegister>MINFO2_MAX_WAIT_MODE</alternateRegister>
               <addressOffset>0x8C</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>P2_NB_TRANSFERS</name>
                     <description>Number of Transfers on Port x [x = 0..7]</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MINFO2_TOTAL_LATENCY_MODE</name>
               <description>Monitor Information Port 2 Register</description>
               <alternateRegister>MINFO2_MAX_WAIT_MODE</alternateRegister>
               <addressOffset>0x8C</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>P2_TOTAL_LATENCY</name>
                     <description>Total Latency on Port x [x = 0..7]</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MINFO3_MAX_WAIT_MODE</name>
               <description>Monitor Information Port 3 Register</description>
               <addressOffset>0x90</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>MAX_PORT3_WAITING</name>
                     <description>Address High on Port x [x = 0..7]</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>BURST</name>
                     <description>Type of Burst on Port x [x = 0..7]</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>3</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>BURSTSelect</name>
                        <enumeratedValue>
                           <name>SINGLE</name>
                           <description>Single transfer</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>INCR</name>
                           <description>Incrementing burst of unspecified length</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>WRAP4</name>
                           <description>4-beat wrapping burst</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>INCR4</name>
                           <description>4-beat incrementing burst</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>WRAP8</name>
                           <description>8-beat wrapping burst</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>INCR8</name>
                           <description>8-beat incrementing burst</description>
                           <value>0x5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>WRAP16</name>
                           <description>16-beat wrapping burst</description>
                           <value>0x6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>INCR16</name>
                           <description>16-beat incrementing burst</description>
                           <value>0x7</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SIZE</name>
                     <description>Transfer Size on Port x [x = 0..7]</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>3</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>SIZESelect</name>
                        <enumeratedValue>
                           <name>_8BITS</name>
                           <description>Byte transfer</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_16BITS</name>
                           <description>Halfword transfer</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_32BITS</name>
                           <description>Word transfer</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_64BITS</name>
                           <description>Dword transfer</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>READ_WRITE</name>
                     <description>Read or Write Access on Port x [x = 0..7]</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MINFO3_NB_TRANSFERS_MODE</name>
               <description>Monitor Information Port 3 Register</description>
               <alternateRegister>MINFO3_MAX_WAIT_MODE</alternateRegister>
               <addressOffset>0x90</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>P3_NB_TRANSFERS</name>
                     <description>Number of Transfers on Port x [x = 0..7]</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MINFO3_TOTAL_LATENCY_MODE</name>
               <description>Monitor Information Port 3 Register</description>
               <alternateRegister>MINFO3_MAX_WAIT_MODE</alternateRegister>
               <addressOffset>0x90</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>P3_TOTAL_LATENCY</name>
                     <description>Total Latency on Port x [x = 0..7]</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MINFO4_MAX_WAIT_MODE</name>
               <description>Monitor Information Port 4 Register</description>
               <addressOffset>0x94</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>MAX_PORT4_WAITING</name>
                     <description>Address High on Port x [x = 0..7]</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>BURST</name>
                     <description>Type of Burst on Port x [x = 0..7]</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>3</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>BURSTSelect</name>
                        <enumeratedValue>
                           <name>SINGLE</name>
                           <description>Single transfer</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>INCR</name>
                           <description>Incrementing burst of unspecified length</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>WRAP4</name>
                           <description>4-beat wrapping burst</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>INCR4</name>
                           <description>4-beat incrementing burst</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>WRAP8</name>
                           <description>8-beat wrapping burst</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>INCR8</name>
                           <description>8-beat incrementing burst</description>
                           <value>0x5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>WRAP16</name>
                           <description>16-beat wrapping burst</description>
                           <value>0x6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>INCR16</name>
                           <description>16-beat incrementing burst</description>
                           <value>0x7</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SIZE</name>
                     <description>Transfer Size on Port x [x = 0..7]</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>3</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>SIZESelect</name>
                        <enumeratedValue>
                           <name>_8BITS</name>
                           <description>Byte transfer</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_16BITS</name>
                           <description>Halfword transfer</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_32BITS</name>
                           <description>Word transfer</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_64BITS</name>
                           <description>Dword transfer</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>READ_WRITE</name>
                     <description>Read or Write Access on Port x [x = 0..7]</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MINFO4_NB_TRANSFERS_MODE</name>
               <description>Monitor Information Port 4 Register</description>
               <alternateRegister>MINFO4_MAX_WAIT_MODE</alternateRegister>
               <addressOffset>0x94</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>P4_NB_TRANSFERS</name>
                     <description>Number of Transfers on Port x [x = 0..7]</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MINFO4_TOTAL_LATENCY_MODE</name>
               <description>Monitor Information Port 4 Register</description>
               <alternateRegister>MINFO4_MAX_WAIT_MODE</alternateRegister>
               <addressOffset>0x94</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>P4_TOTAL_LATENCY</name>
                     <description>Total Latency on Port x [x = 0..7]</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
