Ac6Embedded/svd-microchip/SAMA5D2/ATSAMA5D29TA100.svd
            <register>
               <name>HC1R_SD_SDIO_MODE</name>
               <description>Host Control 1 Register</description>
               <addressOffset>0x28</addressOffset>
               <size>8</size>
               <fields>
                  <field>
                     <name>LEDCTRL</name>
                     <description>LED Control</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>LEDCTRLSelect</name>
                        <enumeratedValue>
                           <name>OFF</name>
                           <description>LED off.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ON</name>
                           <description>LED on.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DW</name>
                     <description>Data Width</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>DWSelect</name>
                        <enumeratedValue>
                           <name>_1_BIT</name>
                           <description>1-bit mode.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_4_BIT</name>
                           <description>4-bit mode.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>HSEN</name>
                     <description>High Speed Enable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DMASEL</name>
                     <description>DMA Select</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>2</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>DMASELSelect</name>
                        <enumeratedValue>
                           <name>SDMA</name>
                           <description>SDMA is selected</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ADMA32</name>
                           <description>32-bit Address ADMA2 is selected</description>
                           <value>0x2</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CARDDTL</name>
                     <description>Card Detect Test Level</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CARDDSEL</name>
                     <description>Card Detect Signal Selection</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HC1R_E_MMC_MODE</name>
               <description>Host Control 1 Register</description>
               <alternateRegister>HC1R_SD_SDIO_MODE</alternateRegister>
               <addressOffset>0x28</addressOffset>
               <size>8</size>
               <fields>
                  <field>
                     <name>DW</name>
                     <description>Data Width</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>DWSelect</name>
                        <enumeratedValue>
                           <name>_1_BIT</name>
                           <description>1-bit mode.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_4_BIT</name>
                           <description>4-bit mode.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>HSEN</name>
                     <description>High Speed Enable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DMASEL</name>
                     <description>DMA Select</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>2</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>DMASELSelect</name>
                        <enumeratedValue>
                           <name>SDMA</name>
                           <description>SDMA is selected</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ADMA32</name>
                           <description>32-bit Address ADMA2 is selected</description>
                           <value>0x2</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>EXTDW</name>
                     <description>Extended Data Width</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PCR</name>
               <description>Power Control Register</description>
               <addressOffset>0x29</addressOffset>
               <size>8</size>
               <fields>
                  <field>
                     <name>SDBPWR</name>
                     <description>SD Bus Power</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>BGCR_SD_SDIO_MODE</name>
               <description>Block Gap Control Register</description>
               <addressOffset>0x2A</addressOffset>
               <size>8</size>
               <fields>
                  <field>
                     <name>STPBGR</name>
                     <description>Stop At Block Gap Request</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CONTR</name>
                     <description>Continue Request</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RWCTRL</name>
                     <description>Read Wait Control</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>INTBG</name>
                     <description>Interrupt at Block Gap</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>INTBGSelect</name>
                        <enumeratedValue>
                           <name>DISABLED</name>
                           <description>Interrupt detection disabled.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENABLED</name>
                           <description>Interrupt detection enabled.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>BGCR_E_MMC_MODE</name>
               <description>Block Gap Control Register</description>
               <alternateRegister>BGCR_SD_SDIO_MODE</alternateRegister>
               <addressOffset>0x2A</addressOffset>
               <size>8</size>
               <fields>
                  <field>
                     <name>STPBGR</name>
                     <description>Stop At Block Gap Request</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CONTR</name>
                     <description>Continue Request</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>WCR</name>
               <description>Wakeup Control Register</description>
               <addressOffset>0x2B</addressOffset>
               <size>8</size>
               <fields>
                  <field>
                     <name>WKENCINT</name>
                     <description>Wakeup Event Enable on Card Interrupt</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>WKENCINTSelect</name>
                        <enumeratedValue>
                           <name>DISABLED</name>
                           <description>Wakeup Event disabled.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENABLED</name>
                           <description>Wakeup Event enabled.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>WKENCINS</name>
                     <description>Wakeup Event Enable on Card Insertion</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>WKENCINSSelect</name>
                        <enumeratedValue>
                           <name>DISABLED</name>
                           <description>Wakeup Event disabled.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENABLED</name>
                           <description>Wakeup Event enabled.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>WKENCREM</name>
                     <description>Wakeup Event Enable on Card Removal</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>WKENCREMSelect</name>
                        <enumeratedValue>
                           <name>DISABLED</name>
                           <description>Wakeup Event disabled.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENABLED</name>
                           <description>Wakeup Event enabled.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>CCR</name>
               <description>Clock Control Register</description>
               <addressOffset>0x2C</addressOffset>
               <size>16</size>
               <fields>
                  <field>
                     <name>INTCLKEN</name>
                     <description>Internal Clock Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>INTCLKS</name>
                     <description>Internal Clock Stable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SDCLKEN</name>
                     <description>SD Clock Enable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CLKGSEL</name>
                     <description>Clock Generator Select</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>USDCLKFSEL</name>
                     <description>Upper Bits of SDCLK Frequency Select</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>SDCLKFSEL</name>
                     <description>SDCLK Frequency Select</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>TCR</name>
               <description>Timeout Control Register</description>
               <addressOffset>0x2E</addressOffset>
               <size>8</size>
               <fields>
                  <field>
                     <name>DTCVAL</name>
                     <description>Data Timeout Counter Value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SRR</name>
               <description>Software Reset Register</description>
               <addressOffset>0x2F</addressOffset>
               <size>8</size>
               <fields>
                  <field>
                     <name>SWRSTALL</name>
                     <description>Software reset for All</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWRSTCMD</name>
                     <description>Software reset for CMD line</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWRSTDAT</name>
                     <description>Software reset for DAT line</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>NISTR_SD_SDIO_MODE</name>
               <description>Normal Interrupt Status Register</description>
               <addressOffset>0x30</addressOffset>
               <size>16</size>
               <fields>
                  <field>
                     <name>CMDC</name>
                     <description>Command Complete</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TRFC</name>
                     <description>Transfer Complete</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BLKGE</name>
                     <description>Block Gap Event</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DMAINT</name>
                     <description>DMA Interrupt</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BWRRDY</name>
                     <description>Buffer Write Ready</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BRDRDY</name>
                     <description>Buffer Read Ready</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CINS</name>
                     <description>Card Insertion</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CREM</name>
                     <description>Card Removal</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CINT</name>
                     <description>Card Interrupt</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ERRINT</name>
                     <description>Error Interrupt</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>NISTR_E_MMC_MODE</name>
               <description>Normal Interrupt Status Register</description>
               <alternateRegister>NISTR_SD_SDIO_MODE</alternateRegister>
               <addressOffset>0x30</addressOffset>
               <size>16</size>
               <fields>
                  <field>
                     <name>CMDC</name>
                     <description>Command Complete</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TRFC</name>
                     <description>Transfer Complete</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BLKGE</name>
                     <description>Block Gap Event</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DMAINT</name>
                     <description>DMA Interrupt</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BWRRDY</name>
                     <description>Buffer Write Ready</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BRDRDY</name>
                     <description>Buffer Read Ready</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BOOTAR</name>
                     <description>Boot Acknowledge Received</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ERRINT</name>
                     <description>Error Interrupt</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
