Ac6Embedded/svd-microchip/SAMA5D2/ATSAMA5D29TA100.svd
            <register>
               <name>NISTER_E_MMC_MODE</name>
               <description>Normal Interrupt Status Enable Register</description>
               <alternateRegister>NISTER_SD_SDIO_MODE</alternateRegister>
               <addressOffset>0x34</addressOffset>
               <size>16</size>
               <fields>
                  <field>
                     <name>CMDC</name>
                     <description>Command Complete Status Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>CMDCSelect</name>
                        <enumeratedValue>
                           <name>MASKED</name>
                           <description>The CMDC status flag in SDMMC_NISTR is masked.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENABLED</name>
                           <description>The CMDC status flag in SDMMC_NISTR is enabled.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TRFC</name>
                     <description>Transfer Complete Status Enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>TRFCSelect</name>
                        <enumeratedValue>
                           <name>MASKED</name>
                           <description>The TRFC status flag in SDMMC_NISTR is masked.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENABLED</name>
                           <description>The TRFC status flag in SDMMC_NISTR is enabled.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>BLKGE</name>
                     <description>Block Gap Event Status Enable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>BLKGESelect</name>
                        <enumeratedValue>
                           <name>MASKED</name>
                           <description>The BLKGE status flag in SDMMC_NISTR is masked.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENABLED</name>
                           <description>The BLKGE status flag in SDMMC_NISTR is enabled.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DMAINT</name>
                     <description>DMA Interrupt Status Enable</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>DMAINTSelect</name>
                        <enumeratedValue>
                           <name>MASKED</name>
                           <description>The DMAINT status flag in SDMMC_NISTR is masked.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENABLED</name>
                           <description>The DMAINT status flag in SDMMC_NISTR is enabled.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>BWRRDY</name>
                     <description>Buffer Write Ready Status Enable</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>BWRRDYSelect</name>
                        <enumeratedValue>
                           <name>MASKED</name>
                           <description>The BWRRDY status flag in SDMMC_NISTR is masked.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENABLED</name>
                           <description>The BWRRDY status flag in SDMMC_NISTR is enabled.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>BRDRDY</name>
                     <description>Buffer Read Ready Status Enable</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>BRDRDYSelect</name>
                        <enumeratedValue>
                           <name>MASKED</name>
                           <description>The BRDRDY status flag in SDMMC_NISTR is masked.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENABLED</name>
                           <description>The BRDRDY status flag in SDMMC_NISTR is enabled.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>BOOTAR</name>
                     <description>Boot Acknowledge Received Status Enable</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>BOOTARSelect</name>
                        <enumeratedValue>
                           <name>MASKED</name>
                           <description>The BOOTAR status flag in SDMMC_NISTR is masked.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENABLED</name>
                           <description>The BOOTAR status flag in SDMMC_NISTR is enabled.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>EISTER_SD_SDIO_MODE</name>
               <description>Error Interrupt Status Enable Register</description>
               <addressOffset>0x36</addressOffset>
               <size>16</size>
               <fields>
                  <field>
                     <name>CMDTEO</name>
                     <description>Command Timeout Error Status Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>CMDTEOSelect</name>
                        <enumeratedValue>
                           <name>MASKED</name>
                           <description>The CMDTEO status flag in SDMMC_EISTR is masked.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENABLED</name>
                           <description>The CMDTEO status flag in SDMMC_EISTR is enabled.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CMDCRC</name>
                     <description>Command CRC Error Status Enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>CMDCRCSelect</name>
                        <enumeratedValue>
                           <name>MASKED</name>
                           <description>The CMDCRC status flag in SDMMC_EISTR is masked.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENABLED</name>
                           <description>The CMDCRC status flag in SDMMC_EISTR is enabled.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CMDEND</name>
                     <description>Command End Bit Error Status Enable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>CMDENDSelect</name>
                        <enumeratedValue>
                           <name>MASKED</name>
                           <description>The CMDEND status flag in SDMMC_EISTR is masked.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENABLED</name>
                           <description>The CMDEND status flag in SDMMC_EISTR is enabled.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CMDIDX</name>
                     <description>Command Index Error Status Enable</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>CMDIDXSelect</name>
                        <enumeratedValue>
                           <name>MASKED</name>
                           <description>The CMDIDX status flag in SDMMC_EISTR is masked.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENABLED</name>
                           <description>The CMDIDX status flag in SDMMC_EISTR is enabled.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DATTEO</name>
                     <description>Data Timeout Error Status Enable</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>DATTEOSelect</name>
                        <enumeratedValue>
                           <name>MASKED</name>
                           <description>The DATTEO status flag in SDMMC_EISTR is masked.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENABLED</name>
                           <description>The DATTEO status flag in SDMMC_EISTR is enabled.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DATCRC</name>
                     <description>Data CRC Error Status Enable</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>DATCRCSelect</name>
                        <enumeratedValue>
                           <name>MASKED</name>
                           <description>The DATCRC status flag in SDMMC_EISTR is masked.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENABLED</name>
                           <description>The DATCRC status flag in SDMMC_EISTR is enabled.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DATEND</name>
                     <description>Data End Bit Error Status Enable</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>DATENDSelect</name>
                        <enumeratedValue>
                           <name>MASKED</name>
                           <description>The DATEND status flag in SDMMC_EISTR is masked.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENABLED</name>
                           <description>The DATEND status flag in SDMMC_EISTR is enabled.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CURLIM</name>
                     <description>Current Limit Error Status Enable</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>CURLIMSelect</name>
                        <enumeratedValue>
                           <name>MASKED</name>
                           <description>The CURLIM status flag in SDMMC_EISTR is masked.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENABLED</name>
                           <description>The CURLIM status flag in SDMMC_EISTR is enabled.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ACMD</name>
                     <description>Auto CMD Error Status Enable</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>ACMDSelect</name>
                        <enumeratedValue>
                           <name>MASKED</name>
                           <description>The ACMD status flag in SDMMC_EISTR is masked.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENABLED</name>
                           <description>The ACMD status flag in SDMMC_EISTR is enabled.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ADMA</name>
                     <description>ADMA Error Status Enable</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>ADMASelect</name>
                        <enumeratedValue>
                           <name>MASKED</name>
                           <description>The ADMA status flag in SDMMC_EISTR is masked.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENABLED</name>
                           <description>The ADMA status flag in SDMMC_EISTR is enabled.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
