Ac6Embedded/svd-microchip/SAMA5D2/ATSAMA5D29TA100.svd
            <register>
               <name>IMR</name>
               <description>Interrupt Mask Register</description>
               <addressOffset>0x4C</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>TXRDY</name>
                     <description>Transmit Ready Interrupt Mask</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXEMPTY</name>
                     <description>Transmit Empty Interrupt Mask</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXRDY</name>
                     <description>Receive Ready Interrupt Mask</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OVRUN</name>
                     <description>Receive Overrun Interrupt Mask</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CP0</name>
                     <description>Compare 0 Interrupt Mask</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CP1</name>
                     <description>Compare 1 Interrupt Mask</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXSYN</name>
                     <description>Tx Sync Interrupt Mask</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXSYN</name>
                     <description>Rx Sync Interrupt Mask</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>WPMR</name>
               <description>Write Protection Mode Register</description>
               <addressOffset>0xE4</addressOffset>
               <fields>
                  <field>
                     <name>WPEN</name>
                     <description>Write Protection Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WPKEY</name>
                     <description>Write Protection Key</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>24</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>WPKEYSelect</name>
                        <enumeratedValue>
                           <name>PASSWD</name>
                           <description>Writing any other value in this field aborts the write operation of the WPEN bit.Always reads as 0.</description>
                           <value>0x535343</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>WPSR</name>
               <description>Write Protection Status Register</description>
               <addressOffset>0xE8</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>WPVS</name>
                     <description>Write Protection Violation Status</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WPVSRC</name>
                     <description>Write Protect Violation Source</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
         </registers>
      </peripheral>
      <peripheral derivedFrom="SSC0">
         <name>SSC1</name>
         <baseAddress>0xFC004000</baseAddress>
         <interrupt>
            <name>SSC1</name>
            <description>Synchronous Serial Controller 1</description>
            <value>44</value>
         </interrupt>
      </peripheral>
      <peripheral>
         <name>SYSCWP</name>
         <version>44155F</version>
         <description>System Controller Write Protection</description>
         <baseAddress>0xF8048194</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x4</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>SYSC_WPMR</name>
               <description>Write Protection Mode Register</description>
               <addressOffset>0x0</addressOffset>
               <fields>
                  <field>
                     <name>WPEN</name>
                     <description>Write Protection Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>WPENSelect</name>
                        <enumeratedValue>
                           <name>WPEN_0</name>
                           <description>Disables the write protection of the configuration registers if WPKEY corresponds to 0x535943 (SYC in ASCII).</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>WPEN_1</name>
                           <description>Enables the write protection of the configuration registers if WPKEY corresponds to 0x535943 (SYC in ASCII).</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>WPKEY</name>
                     <description>Write Protection Key</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>24</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>WPKEYSelect</name>
                        <enumeratedValue>
                           <name>PASSWD</name>
                           <description>Writing any other value in this field aborts the write operation of the WPEN and WPITEN bits. Always reads as 0.</description>
                           <value>0x535943</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
